content/emacs/literate-emacs-configuration.md
+++
title = "Literate Emacs Configuration"
author = ["peregrinator"]
publishDate = 2021-12-04T00:00:00+05:30
lastmod = 2023-03-04T21:24:15+05:30
url = "/emacs/literate_emacs_configuration.html"
draft = false
autonumbering = true
+++

This is a copy of my literate configuration for Emacs and if you're
viewing this anywhere else, don't! Because you can find a readable
version on my [website](https://peregrinator.srht.site/emacs/literate-emacs-configuration.html). You can also find a source-based version with
the rest of my `~/.emacs.d` on my [sourcehut](https:git.sr.ht/~peregrinator/.emacs.d).


## <span class="section-num">1</span> Other init files {#other-init-files}

These are in my `~/.emacs.d` and help load this main configuration.


### <span class="section-num">1.1</span> Early init {#early-init}

This creates a file, [ `early-init.el` ](~/.emacs.d/early-init.el), in `~/.emacs.d`. This was stolen
from Protesilaos some time back. It still needs work - it's not
tangled (by default) yet.

```emacs-lisp

    ;;; early-init.el --- Early Init File -*- lexical-binding: t -*-

;; Copyright (c) 2021-2022 pereginator

;; Author: peregrinator <brihadeesh@protonmail.com>
;; URL: https://git.sr.ht/~peregrinator/dotfiles Version: 0.1.0
;; Package-Requires: ((emacs "28.1"))

;; This file is NOT part of GNU Emacs.

;; This file is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation, either version 3 of the License,
;; or (at your option) any later version.  This file is distributed in
;; the hope that it will be useful, but WITHOUT ANY WARRANTY; without
;; even the implied warranty of MERCHANTABILITY or FITNESS FOR A
;; PARTICULAR PURPOSE.  See the GNU General Public License for more
;; details.  You should have received a copy of the GNU General Public
;; License along with this file.  If not, see
;; <http://www.gnu.org/licenses/>.

    ;;; Commentary:

;; Prior to Emacs 27, the `init.el' was supposed to handle the
;; initialisation of the package manager, by means of calling
;; `package-initialize'.  Starting with Emacs 27, the default
;; behaviour is to start the package manager before loading the init
;; file.

    ;;; Code:

;; Don't initialise installed packages cause package.el sucks balls
(setq package-enable-at-startup nil)

;; Do not resize the frame at this early stage.  (setq
frame-inhibit-implied-resize t)

;; Disable GUI elements ; Disable menu-bar, tool-bar, and scroll-bar.
;;(if (fboundp 'menu-bar-mode) (menu-bar-mode -1)) (if (fboundp
;;'tool-bar-mode) (tool-bar-mode -1)) (if (fboundp 'scroll-bar-mode)
;;(scroll-bar-mode -1)) (setq inhibit-splash-screen t) (setq
;;use-dialog-box nil) ; only for mouse events (setq use-file-dialog
;;nil)

(setq inhibit-startup-screen t) (setq inhibit-startup-buffer-menu t)

;; for when I upgrade to emacs28 with native compilation (setq
native-comp-async-report-warnings-errors nil)

    ;;; early-init.el ends here
```


### <span class="section-num">1.2</span> init.el {#init-dot-el}

I've changed things up a little - this now includes the package
management code and the code for `org` installation.

```emacs-lisp

;;; init.el --- Initialization. -*- lexical-binding: t; -*-

;; Copyright (C) 2022 peregrinator
;; This file is NOT part of GNU Emacs.
;; This file is free software.

;; Author: peregrinator <brihadeesh@protonmail.com>
;; URL: https://git.sr.ht/~peregrinator/.emacs.d
;; Package-Requires: ((emacs "28.1"))

;;; Commentary:
;; This file provides the initialization configuration.

;;; Code:

;; Make emacs startup faster
(defvar startup/file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)
(defun startup/revert-file-name-handler-alist ()
  "Revert file name handler alist."
  (setq file-name-handler-alist startup/file-name-handler-alist))
(add-hook 'emacs-startup-hook 'startup/revert-file-name-handler-alist)

;; For performance
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(setq process-adaptive-read-buffering nil)

;; Load newer .elc or .el
(setq load-prefer-newer t)

```


#### <span class="section-num">1.2.1</span> Package management {#package-management}

Update: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-11-21 Mon&gt;</span></span>
I've moved all of this and some other stuff (garbage collection etc)
to the `init.el`. See the initial org-mode installation section below
for more.


##### <span class="section-num">1.2.1.1</span> Setup `straight.el` {#setup-straight-dot-el}

I'll be using `use-package` to organise and configure individual
packages into neater code blocks although the download will be handled
by `straight.el`. I've included the org-installation here since there's somehow always
an issue with version mismatch.

```emacs-lisp

;;; Configure `straight.el'
;; fetch developmental version of `straight.el'
(setq straight-repository-branch "develop"

      ;; redirect all package repos and builddirs elsewhere
      straight-base-dir "~/.cache/")


;; Bootstrap straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" "~/.cache"))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;;; Configure straight.el (contd.)
;; make all use-package instances use straight.el
(setq straight-use-package-by-default t

      ;; clone depth (probably to save space)
      straight-vc-git-default-clone-depth 1

      ;; Define when to check for package modifications,
      ;; for improved straight.el startup time.
      straight-check-for-modifications nil

      ;; use elpa
      straight-recipes-gnu-elpa-use-mirror t

      straight-host-usernames
      '((github . "brihadeesh")
        (gitlab . "peregrinator")))

```


##### <span class="section-num">1.2.1.2</span> Install and configure `use-package` {#install-and-configure-use-package}

`use-package` is installed and managed by `straight.el` and in turn
packages used in this config are managed/organized by
`use-package`. There's something to do with integration with `use-package`
on the [straight.el readme](https://github.com/raxod502/straight.el/blob/develop/README.md#integration-with-use-package)

```emacs-lisp

;; Install use-package with straight.el
(straight-use-package 'use-package)

```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">1.2.1.3</span> Use-package v2 related changes {#use-package-v2-related-changes}

Need to figure this out - I think maybe `use-package` might not be updated

```emacs-lisp

(eval-when-compile
  (require 'use-package))
(require 'diminish)
(require 'bind-key)

```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">1.2.1.4</span> Minimal `package.el` setup only to browse packages {#minimal-package-dot-el-setup-only-to-browse-packages}

Running `package-list-packages` includes them only for browsing

```emacs-lisp

(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))

```
