content/emacs/literate-emacs-configuration.md


#### <span class="section-num">1.2.2</span> Initial Org-mode installation {#initial-org-mode-installation}

I use the latest version of Org, pulled from the `gnu-elpa` repositories
and have to install it early on so `straight.el` / `use-package` don't
give me trouble with version conflicts because it loads the built in
(older) version first.

```emacs-lisp

;; install org & org-contrib
(straight-use-package 'org)
;; (require 'org)
(straight-use-package 'org-contrib)


;; Load configuration.org
(when (file-readable-p
       (concat user-emacs-directory "configuration.org"))
  (org-babel-load-file
   (concat user-emacs-directory "configuration.org")))

```


#### <span class="section-num">1.2.3</span> End {#end}

```emacs-lisp

;;; init.el ends here

```


## <span class="section-num">2</span> Header {#header}

Just the usual header for elisp files that Emacs keeps complaining
about.

```emacs-lisp
    ;;; configuration.el --- Initialisation. -*- lexical-binding: t; -*-

;; Copyright (C) 2022 peregrinator

;; Author: peregrinator <brihadeesh@protonmail.com>
;; URL: https://git.sr.ht/~peregrinator/.emacs.d
;; Package-Requires: ((emacs "28.1"))

;; This file is NOT part of GNU Emacs.

;; This file is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation, either version 3 of the License,
;; or (at your option) any later version.  This file is distributed in
;; the hope that it will be useful, but WITHOUT ANY WARRANTY; without
;; even the implied warranty of MERCHANTABILITY or FITNESS FOR A
;; PARTICULAR PURPOSE.  See the GNU General Public License for more
;; details.  You should have received a copy of the GNU General Public
;; License along with this file.  If not, see
;; <http://www.gnu.org/licenses/>.


    ;;; Commentary:
;; This file provides the initialization configuration tangled this
;; file.


    ;;; Code:
```


## <span class="section-num">3</span> Prerequisites {#prerequisites}


### <span class="section-num">3.1</span> Reload Emacs configuration {#reload-emacs-configuration}

I'm not sure I understand how this works entirely but [joseph8th's repo](https://github.com/joseph8th/literatemacs#tangle-and-reload)
suggests using `M-: (load-file user-init-file) RET` or evaluating that
same function interactively. I've modified the sanemacs reload config
function below hoping that it works but in that doesn't happen, this
first code block can be evaluated using `C-c C-c`:

<a id="code-snippet--reload-emacs"></a>
```emacs-lisp
(defun reload-config ()
  (interactive)
  (load-file user-init-file))
```


### <span class="section-num">3.2</span> Ensure UTF-8 {#ensure-utf-8}

```emacs-lisp
(set-language-environment 'utf-8)
(prefer-coding-system 'utf-8)
```


### <span class="section-num">3.3</span> Whoami {#whoami}

```emacs-lisp
(setq user-full-name "peregrinator"
      user-mail-address "brihadeesh@protonmail.com")
```


## <span class="section-num">4</span> Writing {#writing}


### <span class="section-num">4.1</span> Org-mode {#org-mode}

-   [X] Get the damn thing first
-   [ ] Organise the thing - needs splitting into multiple code blocks.

Moved the installation to `init.el` along with the `straight.el` bootstrap
to avoid conflicts with the bundled version of the package. I think
this can go back to being a regular `use-package` function but I'm
desperately avoiding having to debug init any further.

```emacs-lisp

(require 'org)
(setq initial-major-mode 'org-mode
      org-display-inline-images t
      org-redisplay-inline-images t
      org-image-actual-width nil
      org-startup-with-inline-images "inlineimages"
      org-catch-invisible-edits 'smart

      ;; sub-headings inherit properties set at parent level
      ;; headings
      org-use-property-inheritance t

      ;; org-ellipsis " ▾"
      ;; hide markers for bold, italic, etc and trailing stars
      org-hide-emphasis-markers t

      ;; fontify code in code blocks
      org-src-fontify-natively t
      org-fontify-quote-and-verse-blocks t
      ;; org-src-tab-acts-natively t

     ;; org-edit-src-content-indentation 2
     org-hide-block-startup nil
     org-src-preserve-indentation nil
     org-edit-src-content-indentation 0

     ;; allow for increased space between org
     ;; org-cycle-separator-lines -1

     ;; hard indentation
     ;; org-adapt-indentation t

     ;; increase indentation by using odd header levels only
     ;; org-odd-levels-only t

     ;; org-startup-folded 'content
     org-capture-bookmark nil
     org-hide-leading-stars t

     ;; org-modern
     org-tags-column -80
     org-ellipsis " ▾"
     org-special-ctrl-a/e t
     ;; org-insert-heading-respect-content t

     ;; display numbers instead of bullets for headings
     ;; org-num-mode t

     ;; faster (single-key) navigation in org-mode
     ;; type `?' for help
     ;; org-use-speed-commands t
     )

    ;;(setq org-modules
    ;;  '(org-crypt
    ;;      org-habit
    ;;      org-bookmark
    ;;      org-eshell
    ;;      org-irc))

    (setq org-refile-targets '((nil :maxlevel . 5)
                               (org-agenda-files :maxlevel . 5)))

    (setq org-outline-path-complete-in-steps nil)
    (setq org-refile-use-outline-path t)

    ;; get something like this for regular emacs bindings
    ;;(evil-define-key '(normal insert visual) org-mode-map (kbd "C-j") 'org-next-visible-heading)
    ;;(evil-define-key '(normal insert visual) org-mode-map (kbd "C-k") 'org-previous-visible-heading)
    ;;(evil-define-key '(normal insert visual) org-mode-map (kbd "M-j") 'org-metadown)
    ;;(evil-define-key '(normal insert visual) org-mode-map (kbd "M-k") 'org-metaup)

    ;; Replace list hyphen with dot
    ;; (font-lock-add-keywords 'org-mode
    ;;                         '(("^ *\\([-]\\) "
    ;;                            (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

```


#### <span class="section-num">4.1.1</span> Fixed pitch for everything code {#fixed-pitch-for-everything-code}

```emacs-lisp

;; Make sure org-indent face is available
(require 'org-indent)

;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

```
