content-org/emacs/literate-emacs-configuration.org
**** Quick source block templates

These can be run by typing an angle bracket with the shortcut and
hitting =<TAB>=.

#+begin_src emacs-lisp

  ;; block templates
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("li" . "src lisp"))
  (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
  (add-to-list 'org-structure-template-alist '("r" . "src R"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("lua" . "src lua"))
  (add-to-list 'org-structure-template-alist '("yml" . "src yaml"))
  (add-to-list 'org-structure-template-alist '("json" . "src json"))
  (add-to-list 'org-structure-template-alist '("aw" . "src awk"))

#+end_src


This creates a unique problem wherein the auto-pairing functionality
(=electric-pair-mode=) creates matching right angle bracket at the end
of the block, messing with Org syntax. This doesn't work as intended
and needs some debugging.

#+begin_src emacs-lisp :tangle no

  ;; disable electric pairing for angle bracket

  (add-hook 'org-mode-hook (lambda ()
             (setq-local electric-pair-inhibit-predicate
                     `(lambda (c)
                    (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))))))

#+end_src

**** TODO Babel

This might require =org-contrib=.

#+begin_src emacs-lisp

  (org-babel-do-load-languages
           'org-babel-load-languages
           '((emacs-lisp . t)
             (R . t)
             (lisp . t)
             (shell . t)
             (org .t)
             (awk . t)))

#+end_src

**** New folding backend

This came with the Org 9.6 release on <2022-11-29 Tue> and I got the
tea from the Org [[https://orgmode.org/Changes.html][changes]] post. This is optimised for files that are
large, and usually more than a few MB in size. I know this file is
only a few kilobytes but I kinda feel it lagging once in a
while. Probably some unrelated issue.

#+begin_src emacs-lisp

  (setq org-fold-core-style 'overlays)

#+end_src

**** TODO Sources for agenda tasks

Generates an agenda from wildcarded org files from the specified
directory

#+begin_src emacs-lisp :tangle no

  ;; (setq org-agenda-files
  ;;       (file-expand-wildcards "~/org/*.org"))

#+end_src

**** Tags and todo-keywords config

 Todo-keywords are things like ~TODO~ and ~DONE~ and so on. Tags are for
 classifying stuff by the general theme of what's being talked about.

***** todo-keywords

#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO(t)" "|" "DONE(d!)" "DISABLED(f!)")))
#+end_src

***** DISABLED tags
:PROPERTIES:
:HEADER-ARGS: tangle no
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp
  (setq org-tag-alist '((("misc" . ?m)
                        ("emacs" . ?e)
                        ("dotfiles" . ?d)
                        ("work" . ?w)
                        ("chore" . ?c)
                        ("blog" . ?b)
                        )))
#+end_src

**** Org-capture

Global keybinding for org-capture

#+begin_src emacs-lisp

(global-set-key (kbd "C-c c") #'org-capture)

#+end_src


This will need to be looked at carefully. Roughly, I need to work out
if I'm going to be using ~org-agenda~ and if so, how will I be using
it. Adding tasks can be made much easier with this. I can also use
this for entering entries into ~org-journal~, making it a whole deal
easier. Perhaps to start off, [[https://orgmode.org/worg/org-tutorials/index.html][the org-mode tutorial]] might be a good
place to start. I've also got a simple enough config from a reddit
post in my [[file:person_el/sample-org-setup.el][unused local elisp libs]] too.

**** Display features

In the spirit of reclaiming some semblance of organisation in this
file, I've tried to group settings by the what aspect they
change. Hopefully this continues and the rest of the Org mode
configuration can be split up.

***** Autoindent/autofill turned on automatically

#+begin_src emacs-lisp

  (add-hook 'org-mode-hook 'org-indent-mode)
  (setq org-startup-indented t)

  ;; organise paragraphs automatically
  (add-hook 'org-mode-hook 'turn-on-auto-fill)

#+end_src

***** Minad's modern UI for org-mode

Was maintaining a [[https://github.com/brihadeesh/org-modern][fork]] but I guess it's too much work - should
considering getting back at it sometime. I was having issues with =TODO=
keywords and tags/categories being rendered absurdly small but
apparently setting =org-modern-label-border= to nil should make them
full sized (see [[https://github.com/minad/org-modern/issues/91][this issue]]). I really must consider using a
variable-pitch font for rich text and headers while restricting
fixed-pitch fonts to header arguments, source blocks and explicitly
code segments in text.

#+begin_src emacs-lisp

  (use-package org-modern
    ;; currently outdated/unmaintained fork
    ;; :straight (:host github :repo "brihadeesh/org-modern")

    :config
    ;; Add frame borders and window dividers
    (modify-all-frames-parameters
     '((right-divider-width . 10)
       (internal-border-width . 5)))
    (dolist (face '(window-divider
                    window-divider-first-pixel
                    window-divider-last-pixel))
      (face-spec-reset-face face)
      (set-face-foreground face (face-attribute 'default :background)))
    (set-face-background 'fringe (face-attribute 'default :background))

    ;; `org-modern' specific config
    (setq org-modern-star ["◉ " "○ " "● " "○ " "● " "○ " "● "]
          org-modern-label-border nil)

    ;; enable the global mode
    (global-org-modern-mode t))

#+end_src

