content-org/emacs/literate-emacs-configuration.org
***** DISABLED Rougier's svg-tag-mode                                 :noexport:
:PROPERTIES:
:header-args: :tangle no
:VISIBILITY: folded
:END:

...to replace janky font-related issues with org-modern

#+begin_src emacs-lisp
    (use-package svg-tag-mode

      :config
      (defconst date-re "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}")
  (defconst time-re "[0-9]\\{2\\}:[0-9]\\{2\\}")
  (defconst day-re "[A-Za-z]\\{3\\}")
  (defconst day-time-re (format "\\(%s\\)? ?\\(%s\\)?" day-re time-re))

  (defun svg-progress-percent (value)
    (svg-image (svg-lib-concat
                (svg-lib-progress-bar (/ (string-to-number value) 100.0)
                                  nil :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
                (svg-lib-tag (concat value "%")
                             nil :stroke 0 :margin 0)) :ascent 'center))

  (defun svg-progress-count (value)
    (let* ((seq (mapcar #'string-to-number (split-string value "/")))
           (count (float (car seq)))
           (total (float (cadr seq))))
    (svg-image (svg-lib-concat
                (svg-lib-progress-bar (/ count total) nil
                                      :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
                (svg-lib-tag value nil
                             :stroke 0 :margin 0)) :ascent 'center)))

  (setq svg-tag-tags
        `(
          ;; Org tags
          (":\\([A-Za-z0-9]+\\)" . ((lambda (tag) (svg-tag-make tag))))
          (":\\([A-Za-z0-9]+[ \-]\\)" . ((lambda (tag) tag)))

          ;; Task priority
          ("\\[#[A-Z]\\]" . ( (lambda (tag)
                                (svg-tag-make tag :face 'org-priority
                                              :beg 2 :end -1 :margin 0))))

          ;; Progress
          ("\\(\\[[0-9]\\{1,3\\}%\\]\\)" . ((lambda (tag)
                                              (svg-progress-percent (substring tag 1 -2)))))
          ("\\(\\[[0-9]+/[0-9]+\\]\\)" . ((lambda (tag)
                                            (svg-progress-count (substring tag 1 -1)))))

          ;; TODO / DONE
          ("TODO" . ((lambda (tag) (svg-tag-make "TODO" :face 'org-todo :inverse t :margin 0))))
          ("DONE" . ((lambda (tag) (svg-tag-make "DONE" :face 'org-done :margin 0))))


          ;; Citation of the form [cite:@Knuth:1984]
          ("\\(\\[cite:@[A-Za-z]+:\\)" . ((lambda (tag)
                                            (svg-tag-make tag
                                                          :inverse t
                                                          :beg 7 :end -1
                                                          :crop-right t))))
          ("\\[cite:@[A-Za-z]+:\\([0-9]+\\]\\)" . ((lambda (tag)
                                                  (svg-tag-make tag
                                                                :end -1
                                                                :crop-left t))))


          ;; Active date (with or without day name, with or without time)
          (,(format "\\(<%s>\\)" date-re) .
           ((lambda (tag)
              (svg-tag-make tag :beg 1 :end -1 :margin 0))))
          (,(format "\\(<%s \\)%s>" date-re day-time-re) .
           ((lambda (tag)
              (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0))))
          (,(format "<%s \\(%s>\\)" date-re day-time-re) .
           ((lambda (tag)
              (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0))))

          ;; Inactive date  (with or without day name, with or without time)
           (,(format "\\(\\[%s\\]\\)" date-re) .
            ((lambda (tag)
               (svg-tag-make tag :beg 1 :end -1 :margin 0 :face 'org-date))))
           (,(format "\\(\\[%s \\)%s\\]" date-re day-time-re) .
            ((lambda (tag)
               (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0 :face 'org-date))))
           (,(format "\\[%s \\(%s\\]\\)" date-re day-time-re) .
            ((lambda (tag)
               (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0 :face 'org-date))))))

        (svg-tag-mode t)
    )
#+end_src

***** Display emphasis markers on hover

This package makes it much easier to edit Org documents when
org-hide-emphasis-markers is turned on. It temporarily shows the
emphasis markers around certain markup elements when you place your
cursor inside of them. No more fumbling around with = and *
characters!

#+begin_src emacs-lisp
  (use-package org-appear
    :hook (org-mode . org-appear-mode))
#+end_src

***** Better commenting in org-mode code-blocks

Got this from a [[https://emacs.stackexchange.com/a/19741/23936][Stack Exchange answer]] to work around messed up
commenting using the default ~C-x C-;~ command. The older/default
command messes up lines, undos, and sometimes comment syntax as well.

#+begin_src emacs-lisp

  ;; allow comment region in the code edit buffer (according to language)
  (defun my-org-comment-dwim (&optional arg)
    (interactive "P")
    (or (org-babel-do-key-sequence-in-edit-buffer (kbd "M-;"))
        (comment-dwim arg)))

  ;; make `C-c C-v C-x M-;' more convenient
  (define-key org-mode-map
    (kbd "M-;") 'my-org-comment-dwim)

#+end_src

***** TOC for org-mode files

#+begin_src emacs-lisp
  (use-package toc-org
      :after org
      :hook (org-mode . toc-org-enable))
#+end_src

Alternatively

#+begin_src emacs-lisp :tangle no
(use-package org-make-toc
  :hook (org-mode . org-make-toc-mode))
#+end_src

***** Convert all org-keywords/block identifiers to lowercase


  It's always nice to see random people online that are crazy like you
  and are nice enough to write elisp code for the shit you need. Stolen
  from [[https://scripter.co/org-keywords-lower-case/][Kaushal Modi]]

  #+begin_src emacs-lisp
  (defun peremacs/lower-case-org-keywords ()
    "Lower case Org keywords and block identifiers.

  Example: \"#+TITLE\" -> \"#+title\"
           \"#+BEGIN_EXAMPLE\" -> \"#+begin_example\"

  Inspiration:
  https://code.orgmode.org/bzg/org-mode/commit/13424336a6f30c50952d291e7a82906c1210daf0."
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (let ((case-fold-search nil)
            (count 0))
        ;; Match examples: "#+foo bar", "#+foo:", "=#+foo=", "~#+foo~",
        ;;                 "‘#+foo’", "“#+foo”", ",#+foo bar",
        ;;                 "#+FOO_bar<eol>", "#+FOO<eol>".
        (while (re-search-forward "\\(?1:#\\+[A-Z_]+\\(?:_[[:alpha:]]+\\)*\\)\\(?:[ :=~’”]\\|$\\)" nil :noerror)
          (setq count (1+ count))
          (replace-match (downcase (match-string-no-properties 1)) :fixedcase nil nil 1))
        (message "Lower-cased %d matches" count))))
  #+end_src





  It's always nice to see random people online that are crazy like you
  and are nice enough to write elisp code for the shit you need. Stolen
  from [[https://scripter.co/org-keywords-lower-case/][Kaushal Modi]]

  #+begin_src emacs-lisp
    (defun peremacs/lower-case-org-keywords ()
      "Lower case Org keywords and block identifiers.

    Example: \"#+TITLE\" -> \"#+title\"
             \"#+BEGIN_EXAMPLE\" -> \"#+begin_example\"

    Inspiration:
    https://code.orgmode.org/bzg/org-mode/commit/13424336a6f30c50952d291e7a82906c1210daf0."
      (interactive)
      (save-excursion
        (goto-char (point-min))
        (let ((case-fold-search nil)
              (count 0))
          ;; Match examples: "#+foo bar", "#+foo:", "=#+foo=", "~#+foo~",
          ;;                 "‘#+foo’", "“#+foo”", ",#+foo bar",
          ;;                 "#+FOO_bar<eol>", "#+FOO<eol>".
          (while (re-search-forward "\\(?1:#\\+[A-Z_]+\\(?:_[[:alpha:]]+\\)*\\)\\(?:[ :=~’”]\\|$\\)" nil :noerror)
            (setq count (1+ count))
            (replace-match (downcase (match-string-no-properties 1)) :fixedcase nil nil 1))
          (message "Lower-cased %d matches" count))))
  #+end_src


** AUCTex for LaTex editing + completion

#+begin_src emacs-lisp
  ;; FIXME:
  ;; (use-package auctex
  ;;   :init
  ;;   (setq TeX-auto-save t)
  ;;   (setq TeX-parse-self t)
  ;;   (setq-default TeX-master nil))

  (use-package auctex
    :demand t
    :no-require t
    :mode ("\\.tex\\'" . TeX-latex-mode)
    :config
    (defun latex-help-get-cmd-alist ()    ;corrected version:
      "Scoop up the commands in the index of the latex info manual.
         The values are saved in `latex-help-cmd-alist' for speed."
      ;; mm, does it contain any cached entries
      (if (not (assoc "\\begin" latex-help-cmd-alist))
          (save-window-excursion
            (setq latex-help-cmd-alist nil)
            (Info-goto-node (concat latex-help-file "Command Index"))
            (goto-char (point-max))
            (while (re-search-backward "^\\* \\(.+\\): *\\(.+\\)\\." nil t)
              (let ((key (buffer-substring (match-beginning 1) (match-end 1)))
                    (value (buffer-substring (match-beginning 2)
                                             (match-end 2))))
                (add-to-list 'latex-help-cmd-alist (cons key value))))))
      latex-help-cmd-alist)

    (add-hook 'TeX-after-compilation-finished-functions
              #'TeX-revert-document-buffer))

  ;; (use-package company-auctex)
#+end_src


** Spellcheck

*** Hunspell
:PROPERTIES:
:header-args: :tangle no
:VISIBILITY: folded
:END:

Finally figured this out from a [[https://redd.it/ahysvb][reddit post from 2019]].

#+begin_src emacs-lisp
  ;; flyspell + aspell??
  (setq ispell-dictionary "en_GB")
  (setq ispell-program-name "hunspell")
  ;; below two lines reset the the hunspell to it STOPS querying locale!
  ;; (setq ispell-local-dictionary "en_GB") ; "en_GB" is key to lookup in `ispell-local-dictionary-alist`

  ;; tell ispell that apostrophes are part of words
  ;; and select Bristish dictionary
  ;; (setq ispell-local-dictionary-alist
  ;;             (quote ("UK_English" "[[:alpha:]]" "[^[:alpha:]]" "['’]" t ("-d" "en_GB") nil utf-8)))

  ;; hook for text mode
  (add-hook 'text-mode-hook 'flyspell-mode)
  ;; hook to check spelling for comments in code
  (add-hook 'prog-mode-hook 'flyspell-prog-mode)
#+end_src

