content/emacs/literate-emacs-configuration.md


#### <span class="section-num">4.3.2</span> Aspell based spellchecking {#aspell-based-spellchecking}

... because Void linux keeps complaining about not being able to find
a British English dictionary

```emacs-lisp
(setq ispell-program-name "aspell")
;; Please note ispell-extra-args contains ACTUAL parameters passed to aspell
(setq ispell-extra-args '("--sug-mode=ultra" "--lang=en_GB"))

;; hook for text mode
(add-hook 'text-mode-hook 'flyspell-mode)
;; hook to check spelling for comments in code
(add-hook 'prog-mode-hook 'flyspell-prog-mode)
```


#### <span class="section-num">4.3.3</span> flyspell-correct provides a more refines UI for spelling checking {#flyspell-correct-provides-a-more-refines-ui-for-spelling-checking}

This shows a popup like for completions when it finds a misspelled
word which makes it somewhat more accessible when writing, rather than
having to look down at the message area.

```emacs-lisp
(use-package flyspell-correct
  :after flyspell
  :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))

(use-package flyspell-correct-popup
  :after flyspell-correct)
```


### <span class="section-num">4.4</span> Something like scrivener from Mac {#something-like-scrivener-from-mac}

...cause I'm gonna become a novelist and/or write large books in the
near future

```emacs-lisp
(use-package binder)
;; (use-package binder-tutorial)
```


### <span class="section-num">4.5</span> Blogging {#blogging}

I've defined some stuff necessary to make editing a Hugo website
easier.


#### <span class="section-num">4.5.1</span> `ox-hugo` since the go-org keep wrecking up links {#ox-hugo-since-the-go-org-keep-wrecking-up-links}

My personal [static site](https://brihadeesh.github.io) was/is written with this. I might have to add
additional setup to add some of this functionality for project pages
but then I hope to eventually move everything to sourcehut or atleast
using it to host a website on my own domain.

This source block continues into the next section.

```emacs-lisp
(use-package ox-hugo
  :after ox)
```

Additional setup for streamlining writing posts on the static site:


##### <span class="section-num">4.5.1.1</span> Blogging flow {#blogging-flow}

Based on the capture templates [documentation](https://ox-hugo.scripter.co/doc/org-capture-setup/).

This function is called on invoking the org-capture (see next
section). This particular function adds a date below the header marked
`CLOSED` which on export to markdown is converted to a regular `date`
field by ox-hugo and is included in the single page view/posts list on
the final export. It also changes the `TODO` tag to `DONE`. I'm still
trying to figure out bundles so this might change soon.

Since the provided template runs independent of my git repo for the
website, I'll have to figure out the `file` variable and how to point it
to the `/content-org/blog/posts.org` file in the repo. From the original
ox-hugo docs code, this is the first template provided, (from under
the entry variable in the source block below):

> It is assumed that below file is present in `org-directory` and that
> it has a "Blog Ideas" heading. It can even be a symlink pointing to
> the actual location of all-posts.org!

So I'll change the `target` to point to my file in the repo directly
until I can assign specific (programmatic ?) definitions for the repo
in this configuration somewhere.

```emacs-lisp

(with-eval-after-load 'org-capture
  (defun org-hugo-new-post-capture ()
    "Returns `org-capture' template string for new Hugo post.
See `org-capture-templates' for more information."
    (let* (;; http://www.holgerschurig.de/en/emacs-blog-from-org-to-hugo/
           (date (format-time-string (org-time-stamp-format :long :inactive) (org-current-time)))
           (title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
           (fname (org-hugo-slug title))
           (section (plist-get org-capture-plist :section))
           (lastmod (plist-get org-capture-alist :lastmod)))
      (mapconcat #'identity
                 `(
                   ,(concat "* DRAFT " title)
                   ":PROPERTIES:"
                   ,(concat "" section)
                   ,(concat ":EXPORT_FILE_NAME: " fname)
                   ,(concat ":EXPORT_HUGO_AUTO_SET_LASTMOD: " lastmod)
                   ;; Enter current date and time
                   ,(concat ":EXPORT_DATE: " date)
                   ":END:"
                   ;; Place the cursor here finally
                   "%?\n")
                 "\n")))

  (setq org-capture-templates
        ;;`org-capture' binding + h
        '(("h"
           "Hugo blog post"
           entry
           (file+olp "~/my_gits/brihadeesh.github.io/content-org/blog/posts.org" "Posts")
           (function org-hugo-new-post-capture)
           :section ":EXPORT_HUGO_SECTION: blog"
           :lastmod "t")

          ;; `org-capture' binding + m
          ("m"
           "Hugo miscellaneous blog post"
           entry
           (file+olp "~/my_gits/brihadeesh.github.io/content-org/blog/posts.org" "Miscellaneous")
           (function org-hugo-new-post-capture)
           :section ":EXPORT_HUGO_SECTION: misc"
           :lastmod "f"))))

```


## <span class="section-num">5</span> Work {#work}


### <span class="section-num">5.1</span> Emacs Speaks Statistics for **R** and python(?) {#emacs-speaks-statistics-for-r-and-python}

Figure out babel/org-tangle or whatever because Emacs sucks for
RMarkdown and org-mode is generally better (see next bit for RMarkdown)

```emacs-lisp
(use-package ess)
;; :ensure t
(require `ess-r-mode)
```


#### <span class="org-todo todo TODO">TODO</span> <span class="section-num">5.1.1</span> Polymodes for R {#polymodes-for-r}

This helps integrate ESS into markdown so editing RMarkdown files is
easy. As an added benefit syntax for regular markdown files is
supported. I won't have to install `polymode` itself explicitly since
it's a dependency for the `poly-R` modes and will be pulled
automatically. I do vaguely remember some issues this caused, will
have to

```emacs-lisp
(use-package poly-R
  :config
  (add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))
  (add-to-list 'auto-mode-alist '("\\.Rmd" . poly-markdown+r-mode))

  :hook
  (poly-markdown-mode . flyspell-mode)
  (poly-markdown-mode . visual-line-mode)
  (poly-markdown-mode . auto-fill-mode))
```
