content-org/emacs/literate-emacs-configuration.org
*** TODO defining org-skeleton for org-babel + R

Got this from [[https://orgmode.org/worg/org-contrib/babel/how-to-use-Org-Babel-for-R.html][worg documentation]] but I vaguely remember reading about
more options for individual source blocks so will have to change /
append accordingly. This defines a skeleton or a format for an org
file header that's specific to writing and running R code. It's bound
to a keybind so it can be accessed easily on opening a fresh org-babel
document.

The other resource was: [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-R.html][R source blocks in Org Mode]]

More info from the page:

1. The =#+INFOJS_OPT= option will generate a HTML document that is
   foldable and follows the style of GNU/INFO document.
2. The =:session *R*= option makes sure all the R code is run in the same
   session so objects generated in one code block can be accessed from
   other code blocks.
3. the =:cache yes= option is used to avoid re-evaluating unchanged code
   blocks. This can save significant time when you revise a document
   with a lot of R code frequently.
4. The =:results output graphics :exports both= option will put both the
   R code and its text and graphics output in the generated document.
5. The =:tangle yes= option allows the document to be "tangled" to
   generate pure code file. The short-cut key for tangling is =C-c C-v
   t=, which generates a .R file with all the R code extracted.
6. Note the =–—= string will generate a horizontal line in HTML file.
7. Finally, a hotkey =C-S-f4= (while pressing Ctrl and Shift keys, press
   F4 key) is assigned to invoke this skeleton quickly.


#+begin_src emacs-lisp

  (define-skeleton org-skeleton
    "Header info for a emacs-org file."
    "Title: "
    "#+TITLE:" str " \n"
    "#+AUTHOR: Brihaadeesh S \n"
    "#+email: brihadeesh.santharam@gmail.com\n"
    "#+INFOJS_OPT: \n"
    "#+BABEL: :session *R* :cache yes :results output graphics :exports both :tangle yes \n"
    "-----"
   )

  (global-set-key [C-S-f4] 'org-skeleton)

#+end_src


** org-present for presentations

See [[https://github.com/daviwil/dotfiles/blob/9776d65c4486f2fa08ec60a06e86ecb6d2c40085/Emacs.org#presentations][dawiwil's section on this]] from his literate init for more about
this.





** TODO Citar for reference management?

[[https://github.com/bdarcus/citar][Citar]]

If I ever get down to writing papers, of course, I'd write them in
~org-mode~ or LaTeX so this should be useful considering =Mendeley
desktop= is bloat and I haven't a clue if FreeBSD even has
=Zotero=. This has additional setup stuff to do with Embark and the
rest of that family. This particular config only works with
~org-mode~. Needs a shit ton of work to properly setup.

Also perhaps check out [[https://github.com/jkitchin/org-ref][org-ref]] - it /seems a lot
simpler/. [[https://www.youtube.com/watch?v=2t925KRBbFc][Introduction to org-ref]] - a video ontroduction

#+begin_src emacs-lisp :tangle no
  ;;(use-package citar
    ;;:no-require
    ;;:custom
    ;;(org-cite-global-bibliography '("~/bib/references.bib"))
    ;;(org-cite-insert-processor 'citar)
    ;;(org-cite-follow-processor 'citar)
    ;;(org-cite-activate-processor 'citar)
    ;; optional: org-cite-insert is also bound to C-c C-x C-@
    ;;:bind
    ;;(:map org-mode-map :package org ("C-c b" . #'org-cite-insert)))
#+end_src





* Project management and navigation - projectile

#+begin_src emacs-lisp
  ;; project management
  (use-package projectile
    ;; :ensure t
    :demand t
    :init (setq projectile-completion-system 'default)
    :bind-keymap
    ("C-c p" . projectile-command-map)
    ;; :diminish projectile-mode
    :config
    (setq projectile-project-search-path '("~/my_gits/" "~/journal/"))
    (projectile-mode +1))



  ;; (use-package ibuffer-projectile
  ;;   :after ibuffer
  ;;   :preface
  ;;   (defun my/ibuffer-projectile ()
  ;;     (ibuffer-projectile-set-filter-groups)
  ;;     (unless (eq ibuffer-sorting-mode 'alphabetic)
  ;;       (ibuffer-do-sort-by-alphabetic)))
  ;;   :hook (ibuffer . my/ibuffer-projectile))
#+end_src




* Denote for note-taking

I hope this is considerably simpler than org-roam and easier to
setup. I don't particularly like the way org-roam is unnecessarily
cluttered and excruciatingly tedious to even get started with.


** Basic setup
#+begin_src emacs-lisp
  (use-package denote
      :straight (:source gnu-elpa-mirror)

    :config
    ;; Remember to check the doc strings of those variables.
    (setq denote-directory (expand-file-name "~/documents/denotes/")

          ;; keywords
          denote-known-keywords '("emacs" "r-stats" "work" "thoughts" "politics" "blog-ideas")

          ;; check
          denote-infer-keywords t

          ;; check
          denote-sort-keywords t

          ;; Org is the default, set others here
          denote-file-type nil

          ;; entry prompt asks for title and keywords
          denote-prompts '(title keywords)

          ;; Pick dates, where relevant, with Org's advanced interface:
          denote-date-prompt-use-org-read-date t

          ;; We allow multi-word keywords by default.  The author's
          ;; personal preference is for single-word keywords for a more
          ;; rigid workflow.
          denote-allow-multi-word-keywords t

          ;; read doc string
          denote-date-format nil

          ;; By default, we fontify backlinks in their bespoke buffer.
          denote-link-fontify-backlinks t)

          ;; Also see `denote-link-backlinks-display-buffer-action'
          ;; which is a bit advanced.

    ;; If you use Markdown or plain text files (Org renders links as buttons
    ;; right away)
    (add-hook 'find-file-hook #'denote-link-buttonize-buffer)

    ;; We use different ways to specify a path for demo purposes.
    (setq denote-dired-directories
          (list denote-directory
                (thread-last denote-directory (expand-file-name "attachments"))
                (expand-file-name "~/documents/denotes/books")))

    ;; Generic (great if you rename files Denote-style in lots of places):
    ;; (add-hook 'dired-mode-hook #'denote-dired-mode)
    ;;
    ;; OR if only want it in `denote-dired-directories':
    (add-hook 'dired-mode-hook #'denote-dired-mode-in-directories)
#+end_src


** TODO Denote templates

This should replace capture templates because the interactive =denote=
call seems a lot more flexible and versatile. Still WIP

#+begin_src emacs-lisp :tangle no

  (setq denote-templates
        `((note . "* Some heading\n\n* Another heading")
          (memo . ,(concat "* Some heading"
                           "\n\n"
                           "* Another heading"
                           "\n\n"))
          (journal-entry . "* Date\n\n** Time")))


#+end_src

