content/emacs/literate-emacs-configuration.md


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">7.3</span> "convenience commands" for journal entries {#convenience-commands-for-journal-entries}

```emacs-lisp

;; (defun peremacs/denote-journal-entry ()
;;   "Create journal entry and prompt for a subdirectory.

;; This is equivalent to calling `denote' when `denote-prompts' is
;; set to '(template subdirectory title keywords)."
;;   (declare (interactive-only t))
;;   (interactive)
;;   (let ((denote-prompts '(subdirectory keywords)))
;;     (denote-)
;;     (call-interactively #'denote)))


(defun peremacs/denote-journal-entry ()
"Create an entry tagged 'journal' with the date as its title."
(interactive)
(denote
 ;; format title like Tuesday 14 June 2022
 (format-time-string "%A %e %B %Y")
 ;; add 'journal' keywords; multiple is a list of strings: '("one" "two")
 '("journal")
 ;; prompt for subdirectory (?)
 (denote--subdirectory-prompt)))

```

Stolen from somewhere

```emacs-lisp

(defun journal-day-exists-p ( target )
  "check if journal for a day already exists"
  (file-expand-wildcards (concat "~/journal/entries/" target "*.org")))

(defun find-previous-journal ()
  "Find most recent journal"
  (let* ((today (format-time-string "%Y%m%d"))
         (all_journals (sort (directory-files "~/journal/entries" nil "^[0-9].*.*org$") #'string>)))
    (dolist (journal all_journals)
      (when (string< (substring journal 0 8) today)
        (return journal)))))

(defun my-denote-journal-today ()
  "Create an entry tagged 'journal' with the date as its title."
  (interactive)
  (let* ((today (format-time-string "%Y%m%d"))
         (filename (car (journal-day-exists-p today)))
         (prev (find-previous-journal)))
    (if filename
        (find-file filename)
      (progn
        (denote
         (format-time-string "%a %d %m %Y (%H:%M)")   ; format like Tuesday 14 Jun 2022
         nil
         "~/journal/entries")
        (insert "* THOUGHTS\n\n* IDEAS\n\n* CODE\n\n* TASKS\n\n")
        (save-buffer)))))

(defun my-denote-journal-date()
  (declare (interactive-only t))
  (interactive)
  (let* ((date (org-read-date nil t))
         (filename (car (journal-day-exists-p (format-time-string "%Y%m%d" date)))))
    (if filename
        (find-file filename)
      (progn
        (denote
         (format-time-string "%a %d %m %Y" date)   ; format like Tuesday 14 June 2022
         nil
         "~/journal/entries")))))

```


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">7.4</span> Keybindings {#keybindings}

Denote DOES NOT define any key bindings. It requires arguments
acceptable to the `bind-keys` macro. I'm not entirely sure some of these
are necessary since I'm using a capture template.

```emacs-lisp
;; :bind
;; (("C-c n n" . denote)
;;  ("C-c n N" . denote-type)
;;  ("C-c n d" , denote-date)
;;  ("C-c n s" . denote-subdirectory)
;;  ("C-c n t" . denote-template)
;;  ;; renames don't work with `dired-mode', hence placed here
;;  ("C-c n r" . denote-rename-file)
;;  ("C-c n R" . denote-rename-file-using-front-matter)

;;  ;; org-mode specifics (group with `global-mode-map' for multiple formats
;;  ;; or add for each `markdown'/`text'/`org' if using single format)
;;  :map org-mode-map
;;  ("C-c n i" . denote-link) ; "insert" mnemonic
;;  ("C-c n I" . denote-link-add-links)
;;  ("C-c n b" . denote-link-backlinks)
;;  ("C-c n f f" . denote-link-find-file)
;;  ("C-c n f b" . denote-link-find-backlink)

;;  ;; specific to dired
;;  :map dired-mode-map
;;  ("C-c C-d C-i" . denote-link-dired-marked-notes)
;;  ("C-c C-d C-r" . denote-dired-rename-marked-files)
;;  ("C-c C-d C-R" . denote-dired-rename-marked-files-using-front-matter)
;;  ;; Also check the commands `denote-link-after-creating',
;;  ;; `denote-link-or-create'.  You may want to bind them to keys as well.
;; )

)
```


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">7.5</span> `org-journal` for journaling requirements {#org-journal-for-journaling-requirements}

This needs better setting up and integration with either `Orgzly` or
`GitJournal` for android. iOS seems to have better apps though. Or
just make this workable with the termux version of Emacs.

```emacs-lisp
(use-package org-journal
  :init
  ;; Change default prefix key; needs to be set before loading org-journal
  (setq org-journal-prefix-key "C-c j ")

  :bind
  ;; (("C-c t" . journal-file-today)
  ;;  ("C-c y" . journal-file-yesterday))

  :config
  ;; Journal directory and files
  (setq org-journal-dir "~/journal/entries/"
        org-journal-file-format "%Y/%m/%Y%m%d.org"
        org-journal-file-type 'daily
        org-journal-find-file 'find-file)

  ;; Journal file content
  (setq org-journal-date-format "%e %b %Y (%A)"
        org-journal-time-format "(%R)"
        org-journal-file-header "#+title: Daily Journal\n#+startup: showeverything")
  )
```


## <span class="section-num">8</span> Version control {#version-control}


### <span class="section-num">8.1</span> Git with Magit and gists with `gist.el` {#git-with-magit-and-gists-with-gist-dot-el}

<a id="code-snippet--magit-config"></a>
```emacs-lisp
(use-package magit
  :bind ("C-x g"    . magit-status))
```

`gist.el` to manage github gists from here

<a id="code-snippet--gists-config"></a>
```emacs-lisp
(use-package gist)
```


### <span class="section-num">8.2</span> Undo tree {#undo-tree}

Helps revert to older versions of files in case I fuck up something
somewhere. Hmm. I doubt I ever use it so disabling it now.

```emacs-lisp
(use-package undo-tree
  :init
  (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo"))
        undo-tree-auto-save-history nil)
  (global-undo-tree-mode)
  :diminish undo-tree-mode)
```


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">8.3</span> SSH for personal packages and magit {#ssh-for-personal-packages-and-magit}

This needs a ton of work

```emacs-lisp
(use-package keychain-environment
    :config
    (keychain-refresh-environment))

;; ;; import ssh deets from profile
;; (use-package exec-path-from-shell
;;   :config
;;   (exec-path-from-shell-copy-env "SSH_AGENT_PID")
;;   (exec-path-from-shell-copy-env "SSH_AUTH_SOCK"))
```


## <span class="section-num">9</span> Minibuffer completion {#minibuffer-completion}


### <span class="section-num">9.1</span> Access a list of recently edited files {#access-a-list-of-recently-edited-files}

Helps jump back into whatever I was doing before closing Emacs. Or my
laptop more like it.

```emacs-lisp
(use-package recentf
  :init
  (setq recentf-max-menu-items 25
        recentf-auto-cleanup 'never
        recentf-keep '(file-remote-p file-readable-p))
  (recentf-mode 1))
```
