content-org/emacs/literate-emacs-configuration.org
** Vertico for completions UI

#+begin_src emacs-lisp
  ;; Enable vertico
  (use-package vertico
    ;; pulls extensions as well?
    ;; :straight (:host github :repo "minad/vertico")

    :init
    (vertico-mode)

    :config
    (setq
     ;; Grow and shrink the Vertico minibuffer
     vertico-resize t

     ;; No prefix with number of entries
     vertico-count-format nil)

    (advice-add #'tmm-add-prompt :after #'minibuffer-hide-completions)
#+end_src

(Continuing from previous block)


Completion-at-point and completion-in-region with Vertico. Use
`consult-completion-in-region' if Vertico is enabled. Otherwise use
the default `completion--in-region' function. Disabled because I use
corfu for =completion-at-point=.

#+begin_src emacs-lisp
  ;; (setq completion-in-region-function
  ;;           (lambda (&rest args)
  ;;             (apply (if vertico-mode
  ;;                        #'consult-completion-in-region
  ;;                      #'completion--in-region)
  ;;                    args)))
#+end_src

Prefix the current candidate (See [[https://github.com/minad/vertico/wiki#prefix-current-candidate-with-arrow][relevant section on the wiki]])

#+begin_src emacs-lisp
  (defun minibuffer-format-candidate (orig cand prefix suffix index _start)
      (let ((prefix (if (= vertico--index index)
                        "  "
                      "   ")))
        (funcall orig cand prefix suffix index _start)))

    (advice-add #'vertico--format-candidate
               :around #'minibuffer-format-candidate)
#+end_src


Completions for ~M-:~ as well; closes the use-package function started
at Vertico header.

#+begin_src emacs-lisp
(defun minibuffer-vertico-setup ()

  (setq truncate-lines t)
  (setq completion-in-region-function
        (if vertico-mode
            #'consult-completion-in-region
          #'completion--in-region)))

(add-hook 'vertico-mode-hook #'minibuffer-vertico-setup)
(add-hook 'minibuffer-setup-hook #'minibuffer-vertico-setup)
)
#+end_src

*** TODO Vertico extensions
:PROPERTIES:
:header-args: :tangle no
:END:

Again stolen from Karthik Chikmaglur and needs heavy work, hence not enabled

#+name: vertico-multiform
#+begin_src emacs-lisp
  (use-package vertico-multiform
    :load-path "~/.emacs.d/lisp/vertico-extensions/"
    :commands vertico-multiform-mode
    :after vertico-flat
    :bind (:map vertico-map
                ("M-q" . vertico-multiform-grid)
                ("C-l" . vertico-multiform-unobtrusive)
                ("C-M-l" . embark-export))
    :init (vertico-multiform-mode 1)
    :config
    (setq vertico-multiform-categories
           '((file my/vertico-grid-mode reverse)
             (project-file my/vertico-grid-mode reverse)
             (imenu buffer)
             (consult-location buffer)
             (consult-grep buffer)
             (notmuch-result reverse)
             (minor-mode reverse)
             (reftex-label reverse)
             (bib-reference reverse)
             (xref-location reverse)
             (t unobtrusive)))
     (setq vertico-multiform-commands
           '((load-theme my/vertico-grid-mode reverse)
             (my/toggle-theme my/vertico-grid-mode reverse)
             (consult-dir-maybe reverse)
             (consult-dir reverse)
             (consult-history reverse)
             (consult-completion-in-region reverse)
             (completion-at-point reverse)
             (org-roam-node-find reverse)
             (embark-completing-read-prompter reverse)
             (embark-act-with-completing-read reverse)
             (embark-prefix-help-command reverse)
             (tmm-menubar reverse)))

     (defun vertico-multiform-unobtrusive ()
       "Toggle the quiet display."
       (interactive)
       (vertico-multiform--display-toggle 'vertico-unobtrusive-mode)
       (if vertico-unobtrusive-mode
           (vertico-multiform--temporary-mode 'vertico-reverse-mode -1)
         (vertico-multiform--temporary-mode 'vertico-reverse-mode 1))))
#+end_src

#+name: vertico-unobtrusive
#+begin_src emacs-lisp
  (use-package vertico-unobtrusive
    :load-path "~/.local/share/git/vertico/extensions/"
    :after vertico-flat)
#+end_src

#+name vertico-grid
#+begin_src emacs-lisp
    (use-package vertico-grid
      :load-path "~/.emacs.d/lisp/vertico-extensions/"
      :after vertico
      ;; :bind (:map vertico-map ("M-q" . vertico-grid-mode))
      :config
      (defvar my/vertico-count-orig vertico-count)
      (define-minor-mode my/vertico-grid-mode
        "Vertico-grid display with modified row count."
        :global t :group 'vertico
        (cond
         (my/vertico-grid-mode
          (setq my/vertico-count-orig vertico-count)
          (setq vertico-count 4)
          (vertico-grid-mode 1))
         (t (vertico-grid-mode 0)
            (setq vertico-count my/vertico-count-orig))))
      (setq vertico-grid-separator "    ")
      (setq vertico-grid-lookahead 50))
  #+end_src

#+name: vertico-quick
#+begin_src emacs-lisp
(use-package vertico-quick
      :load-path "~/.emacs.d/lisp/vertico-extensions/"
      :after vertico
      :bind (:map vertico-map
             ("M-i" . vertico-quick-insert)
             ("C-'" . vertico-quick-exit)
             ("C-o" . vertico-quick-embark))
      :config
      (defun vertico-quick-embark (&optional arg)
        "Embark on candidate using quick keys."
        (interactive)
        (when (vertico-quick-jump)
          (embark-act arg))))
#+end_src

#+name: vertico-directory
#+begin_src emacs-lisp
    (use-package vertico-directory
      :load-path "~/.emacs.d/lisp/vertico-extensions/"
      :hook (rfn-eshadow-update-overlay vertico-directory-tidy)
      :after vertico
      :bind (:map vertico-map
             ("DEL"   . vertico-directory-delete-char)
             ("M-DEL" . vertico-directory-delete-word)
             ("C-w"   . vertico-directory-delete-word)
             ("RET"   . vertico-directory-enter)))
#+end_src

#+name:vertico-repeat
#+begin_src emacs-lisp
    (use-package vertico-repeat
      :load-path "~/.emacs.d/lisp/vertico-extensions/"
      :after vertico
      :bind (("C-x ." . vertico-repeat)))
#+end_src

#+name:vertico-reverse
#+begin_src emacs-lisp
    (use-package vertico-reverse
      ;; :disabled
      :load-path "~/.emacs.d/lisp/vertico-extensions/"
      :after vertico)
#+end_src

#+name:vertico-repeat
#+begin_src emacs-lisp
  (use-package vertico-flat
    :load-path "~/.emacs.d/lisp/vertico-extensions/"
    ;; :bind (:map vertico-map
    ;;             ("M-q" . vertico-flat-mode))
    :after vertico)
#+end_src

#+name:vertico-buffer
#+begin_src emacs-lisp
(use-package vertico-buffer
      :load-path "~/.emacs.d/lisp/vertico-extensions/"
      :after vertico
      ;; :hook (vertico-buffer-mode . vertico-buffer-setup)
      :config
      (setq vertico-buffer-display-action 'display-buffer-reuse-window))
#+end_src


