content/emacs/literate-emacs-configuration.md


### <span class="section-num">9.7</span> Consult adds more minibuffer functionality {#consult-adds-more-minibuffer-functionality}

```emacs-lisp
(use-package consult
  ;; Replace bindings. Lazily loaded due by `use-package'.
  :bind
  (("C-x B" . consult-buffer)
   ("C-x 4 b" . consult-buffer-other-window)
   ("C-x 5 b" . consult-buffer-other-frame)
   ("M-g i" . consult-imenu)
   ("M-g I" . consult-project-imenu)
   ;; searching for files
   ("M-s f" . consult-find)
   ("M-s F" . consult-git-grep)
   ("M-s g" . consult-grep)
   ("M-s r" . consult-ripgrep)
   ("C-c f r" . consult-recent-file)
   ("C-x C-" . consult-recent-file)
   ;; Isearch integration
   ("C-s" . consult-isearch-history)
   ("C-c L" . consult-outline)
   ("C-c h l" . consult-org-heading)
   ;; yank from kill-ring
   ("M-y" . consult-yank-pop)
   )

  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI. You may want to also
  ;; enable `consult-preview-at-point-mode` in Embark Collect buffers.
  :hook (completion-list-mode . consult-preview-at-point-mode)

  :config
  ;; Configure the narrowing key.
  (setq consult-narrow-key "<") ;; (kbd "C-+")

  ;; Configure a function which returns the project
  ;; root directory - projectile.el (projectile-project-root)
  (autoload 'projectile-project-root "projectile")
  (setq consult-project-root-function #'projectile-project-root)

  ;; use consult with perspective.el
  (consult-customize consult--source-buffer :hidden t :default nil)

  (defvar consult--source-perspective
    (list :name     "Perspective"
          :narrow   ?s
          :category 'buffer
          :state    #'consult--buffer-state
          :default  t
          :items    #'persp-get-buffer-names))

  (push consult--source-perspective consult-buffer-sources)
  )

;; Optionally add the `consult-flycheck' command.
(use-package consult-flycheck
  :bind (:map flycheck-command-map
              ("!" . consult-flycheck)))
```


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">9.8</span> Consult interface for denote {#consult-interface-for-denote}

I haven't really figured out how to programmatically add additional
functionality/features for consult, nor have I figured out denote.  I
got this from one random [blog post](https://whhone.com/posts/denote-with-subdirectories/) about denote while looking for how
people use denote to work with sub-directories. I've just grabbed the
files from their [package](https://codeberg.org/whhone/consult-denote/) for now but I might need to extend this if I
end up switching to using denote for journaling.

```emacs-lisp

(use-package consult-denote
   :straight (consult-denote :type git :host codeberg :repo "whhone/consult-denote"))

```


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">9.9</span> Embark - actions; reorganise {#embark-actions-reorganise}

This I've not used yet but makes a lot of stuff easier like
searchingfor the `definition` or the `help/info` page a highlighted
word from within the buffer or the minibuffer or even the minibuffer
completion list.

**Group with the rest of the packages from this family?**

```emacs-lisp
(use-package embark
  :bind
  (("C-S-a" . embark-act)       ;; pick some comfortable binding
   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

;; Consult users will also want the embark-consult package.
(use-package embark-consult
  :ensure t
  :after (embark consult)
  :demand t ; only necessary if you have the hook below
  ;; if you want to have consult previews as you move around an
  ;; auto-updating embark collect buffer
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))
```


## <span class="section-num">10</span> Corfu for completion in buffer {#corfu-for-completion-in-buffer}

This might need some more work - integration with [minad's `cape`](https://github.com/minad/cape) for
various kinds of completions although he alleges this works well with
base Emacs.

<a id="code-snippet--corfu-competions"></a>
```emacs-lisp

(use-package corfu
  :bind
  (:map corfu-map
         ;; ??? :states 'insert
         ("TAB" . corfu-next)
         ([tab] . corfu-next)
         ("S-TAB" . corfu-previous)
         ([backtab] . corfu-previous)
         ("<escape>" . corfu-quit)
         ("<return>" . corfu-insert)
         ("M-d" . corfu-show-documentation)
         ("M-l" . 'corfu-show-location)
         ("SPC" . corfu-insert-separator))

  :custom
  ;; Only use `corfu' when calling `completion-at-point' or
  ;; (corfu-auto t)

  ;; `indent-for-tab-command'
  ;; (corfu-auto-prefix 3)
  ;; (corfu-auto-delay 0.2)

  ;; size
  (corfu-min-width 80)

  ;; Always have the same width
  (corfu-max-width corfu-min-width)
  (corfu-count 14)
  (corfu-scroll-margin 4)
  (corfu-cycle t)

  ;; Show documentation in echo area?
  (corfu-echo-documentation t)

  ;; Preselect first candidate?
  (corfu-preselect-first nil)

  ;; Preview current candidate?
  (corfu-preview-current 'insert)

  ;; quit if no match
  (corfu-quit-no-match t)

  :init
  (global-corfu-mode))

```


### <span class="section-num">10.1</span> CAPE - extensions for corfu {#cape-extensions-for-corfu}

Corfu needs `cape` to provide completion backends because it's extremely
stripped down. Will have to check what other backends I'll need to
enable.

```emacs-lisp
(use-package cape
    :config
    (setq cape-dabbrev-min-length 2)

    :init
    ;; Add `completion-at-point-functions', used by `completion-at-point'.

    (dolist (backend '( cape-file cape-dabbrev cape-keyword cape-abbrev
                        cape-ispell cape-dict cape-symbol cape-line ))
                     (add-to-list 'completion-at-point-functions backend)))

(add-to-list 'completion-at-point-functions #'cape-file)
(add-to-list 'completion-at-point-functions #'cape-keyword)
(add-to-list 'completion-at-point-functions #'cape-ispell)
(add-to-list 'completion-at-point-functions #'cape-dict)
(add-to-list 'completion-at-point-functions #'cape-symbol)
```


## <span class="section-num">11</span> Look {#look}


### <span class="section-num">11.1</span> Font configuration {#font-configuration}


#### <span class="section-num">11.1.1</span> Setting a font {#setting-a-font}

```emacs-lisp

;; first set default
(set-face-attribute 'default nil :family "Hack" :height 70)

;; then set variable-pitch fonts
(set-face-attribute 'variable-pitch nil :family "Iosevka Aile" :height 1.1)

;; finally set fixed-pitch
(set-face-attribute 'fixed-pitch nil :family "Hack" :height 1.0)

```


#### <span class="section-num">11.1.2</span> Line spacing {#line-spacing}

Usually 0, less if possible but Emacs doesn't allow for that.

```emacs-lisp
;; Line spacing, can be 0 for code and 1 or 2 for text
(setq-default line-spacing 0.1)
```


### <span class="section-num">11.2</span> Editor theme {#editor-theme}

Update: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-11-21 Mon&gt; </span></span> Moved this up so it doesn't throw the cryptic
error with Modus themes: `Debugger entered--Lisp error: (wrong-number-of-arguments (1
. 2) 8)` This is based on [Adam Spiers's comment](https://gitlab.com/protesilaos/modus-themes/-/issues/306#note_1147003189) - the theme should be
loaded before `custom.el` is pulled in to avoid issues with version
mismatch like the shit with the `org` package.
