content-org/emacs/literate-emacs-configuration.org
*** ef-themes

#+begin_src emacs-lisp

(use-package ef-themes
  :config
  ;; If you like two specific themes and want to switch between them, you
  ;; can specify them in `ef-themes-to-toggle' and then invoke the command
  ;; `ef-themes-toggle'.  All the themes are included in the variable
  ;; `ef-themes-collection'.
  (setq ef-themes-to-toggle '(ef-night ef-duo-dark ef-winter))

  (setq ef-themes-headings ; read the manual's entry or the doc string
	'((0 . (variable-pitch light 1.2))
          (1 . (variable-pitch light 1.1))
          (2 . (variable-pitch regular))
          (3 . (variable-pitch regular))
          (4 . (variable-pitch regular))
          (5 . (variable-pitch)) ; absence of weight means `bold'
          (6 . (variable-pitch))
          (7 . (variable-pitch))
          (t . (variable-pitch))))

  ;; They are nil by default...
  (setq ef-themes-mixed-fonts t
	ef-themes-variable-pitch-ui t)

  ;; Read the doc string or manual for this one.  The symbols can be
  ;; combined in any order.
  (setq ef-themes-region '(intense no-extend neutral))

  ;; Disable all other themes to avoid awkward blending:
  (mapc #'disable-theme custom-enabled-themes)

  ;; Load the theme of choice:
  ;; (load-theme 'ef-summer :no-confirm)

  ;; OR use this to load the theme which also calls `ef-themes-post-load-hook':
  ;; (ef-themes-select 'ef-winter)

  ;; The themes we provide are recorded in the `ef-themes-dark-themes',
  ;; `ef-themes-light-themes'.

  ;; We also provide these commands, but do not assign them to any key:
  ;;
  ;; - `ef-themes-toggle'
  ;; - `ef-themes-select'
  ;; - `ef-themes-load-random'
  ;; - `ef-themes-preview-colors'
  ;; - `ef-themes-preview-colors-current'
  )

#+end_src

*** Modus from Protesilaos!

This might need additional setting since modus themes are now included
within Emacs

#+begin_src emacs-lisp
(use-package modus-themes
  :straight (:source gnu-elpa-mirror)

  :init
  (setq modus-themes-mixed-fonts t
        modus-themes-bold-constructs t
        modus-themes-italic-constructs t
        modus-themes-region '(no-extend)
        modus-themes-mode-line '(accented)
        modus-themes-prompts '(backgound bold intense)
        ;; modus-themes-hl-line 'accented
        modus-themes-intense-markup t
        modus-themes-region '(no-extend bg-only)
        modus-themes-subtle-line-numbers t
        modus-themes-fringes '(subtle)
        modus-themes-language-checkers '(straight-underline faint)
        modus-themes-org-blocks '(gray-background)

        modus-themes-completions
        '((matches . (bold background intense))
          (selection . (bold background intense))
          (popup . (accented))))

  (defun peremacs/call-modus-operandi ()
    (interactive)
    ;; heading backgrounds work better here
    (disable-theme 'modus-vivendi)
    (setq modus-themes-headings
          '((1 . (overline background variable-pitch bold 1.1))
            (2 . (overline background variable-pitch bold))
            (3 . (overline background variable-pitch semibold))
            (4 . (overline background variable-pitch semibold))
            (t . (overline variable-pitch semibold))))
    (modus-themes-load-operandi))

  (defun peremacs/call-modus-vivendi ()
    (interactive)
    (disable-theme 'modus-operandi)
    (setq modus-themes-headings
          '((1 . (overline monochrome variable-pitch bold 1.1))
            (2 . (overline monochrome variable-pitch bold))
            (3 . (overline monochrome variable-pitch semibold))
            (4 . (overline monochrome variable-pitch semibold))
            (t . (overline variable-pitch semibold))))
    (modus-themes-load-vivendi))


  ;; set semibold as the bold face
  ;; (for those fonts that provide this face)
  ;; (set-face-attribute 'bold nil :weight 'semibold)


  ;; :config
  ;; Load the theme files before enabling a theme
  (modus-themes-load-themes)

  ;; Load the theme of your choice:
  ;; (peremacs/call-modus-operandi)
  (peremacs/call-modus-vivendi)
)

#+end_src

*** Commentary

An elegant theme highlighting comments only

#+begin_src emacs-lisp

  (use-package commentary-theme
    ;;:config
    ;;(load-theme 'commentary t)
    )

#+end_src

*** My themes

Neither of these work using =straight.el= or =use-package=, together
or separately (afaik). If these work, I could maybe add some more of
my own.

Forked from the [[https://github.com/lthms/colorless-themes][colorless-themes macro]]. This includes my version of
the macro, original themes from Thomas Letan, and some additional
themes of my own that use this macro.

#+begin_src emacs-lisp

  (use-package colourless-themes
      :straight (:host gitlab :repo "peregrinator/colourless-themes-el")
      ;;:config
      ;;(load-theme 'beelzebub t)
      )

#+end_src

*** DISABLED unused
:PROPERTIES:
:header-args: :tangle no
:VISIBILITY: folded
:END:
**** DISABLED Wilmersdorf

I saw this on [[https://github.com/hlissner/emacs-doom-themes][doom-themes]] but I don't want to pull all of those just
for this, so installing from it's [[https://github.com/ianyepan/wilmersdorf-emacs-theme][GitHub]] using ~straight.el~. But it
fails to load with ~use-package~ so I'm going to have to do it manually.

#+begin_src emacs-lisp
    (use-package wilmersdorf
      :straight (:host github :repo "ianyepan/wilmersdorf-emacs-theme")

      ;; :config
      ;; (load-theme 'wilmersdorf t)
      )
#+end_src

**** DISABLED Tao

Monochrome theme with minimal bold highlights and boxes?

#+begin_src emacs-lisp
  (use-package tao-theme
    :config
    ;; load theme
    (load-theme 'tao-yang t)
    ;; (load-theme 'tao-yin t)
    )
#+end_src

**** DISABLED Expresso
:PROPERTIES:
:header-args: :tangle no
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp
(use-package espresso-theme
    :straight (:host github :repo "dgutov/espresso-theme")
    ;;:config
    (load-theme 'espresso t)
    )
#+end_src

**** DISABLED Github dark

#+begin_src emacs-lisp
  (use-package github-dark-vscode-theme
    :config
    (load-theme 'github-dark-vscode t)

    ;; fixed upstream
    ;; unrelated but the cursor colour really needs improvement
    ;; (set-cursor-color "#ffffff")
    )
#+end_src

**** DISABLED Github modern (light)

#+begin_src emacs-lisp
  (use-package github-modern-theme
    :config
    (load-theme 'github-modern t)
    )
#+end_src

**** DISABLED Vale

#+begin_src emacs-lisp
  (use-package vale
    :straight (:type git :repo "https://codeberg.org/ext0l/vale.el")
    :config
    ;; (load-theme 'vale t)
    )
#+end_src

**** DISABLED Parchment

Based on the screenshot of Haskell code on the [[https://fsd.it/shop/fonts/pragmatapro/#tab-fb289adf-7c14-8][Pragmata Pro website]].

#+begin_src emacs-lisp :tangle no
  (use-package Parchment-theme
    :straight (:host github :repo "brihadeesh/emacs-parchment-theme")
    :config
    ;; (load-theme 'Parchment t)
    )
#+end_src

**** DISABLED Almost mono

#+begin_src emacs-lisp
  (use-package almost-mono-themes
    :config
    ;; (load-theme 'almost-mono-black t)
    ;; (load-theme 'almost-mono-gray t)
    ;; (load-theme 'almost-mono-cream t)
    ;; (load-theme 'almost-mono-white t)
    )
#+end_src

**** DISABLED Stimmung themes for nearly monochrome appearance


#+begin_src emacs-lisp
  (use-package stimmung-themes
    ;; :straight (stimmung-themes :host github :repo "motform/stimmung-themes") ; if you are a straight shooter
    :config
    ;; (stimmung-themes-load-dark)
    )
#+end_src


