content/emacs/literate-emacs-configuration.md


#### <span class="section-num">11.2.1</span> ef-themes {#ef-themes}

```emacs-lisp

(use-package ef-themes
  :config
  ;; If you like two specific themes and want to switch between them, you
  ;; can specify them in `ef-themes-to-toggle' and then invoke the command
  ;; `ef-themes-toggle'.  All the themes are included in the variable
  ;; `ef-themes-collection'.
  (setq ef-themes-to-toggle '(ef-night ef-duo-dark ef-winter))

  (setq ef-themes-headings ; read the manual's entry or the doc string
        '((0 . (variable-pitch light 1.2))
          (1 . (variable-pitch light 1.1))
          (2 . (variable-pitch regular))
          (3 . (variable-pitch regular))
          (4 . (variable-pitch regular))
          (5 . (variable-pitch)) ; absence of weight means `bold'
          (6 . (variable-pitch))
          (7 . (variable-pitch))
          (t . (variable-pitch))))

  ;; They are nil by default...
  (setq ef-themes-mixed-fonts t
        ef-themes-variable-pitch-ui t)

  ;; Read the doc string or manual for this one.  The symbols can be
  ;; combined in any order.
  (setq ef-themes-region '(intense no-extend neutral))

  ;; Disable all other themes to avoid awkward blending:
  (mapc #'disable-theme custom-enabled-themes)

  ;; Load the theme of choice:
  ;; (load-theme 'ef-summer :no-confirm)

  ;; OR use this to load the theme which also calls `ef-themes-post-load-hook':
  ;; (ef-themes-select 'ef-winter)

  ;; The themes we provide are recorded in the `ef-themes-dark-themes',
  ;; `ef-themes-light-themes'.

  ;; We also provide these commands, but do not assign them to any key:
  ;;
  ;; - `ef-themes-toggle'
  ;; - `ef-themes-select'
  ;; - `ef-themes-load-random'
  ;; - `ef-themes-preview-colors'
  ;; - `ef-themes-preview-colors-current'
  )

```


#### <span class="section-num">11.2.2</span> Modus from Protesilaos! {#modus-from-protesilaos}

This might need additional setting since modus themes are now included
within Emacs

```emacs-lisp
(use-package modus-themes
  :straight (:source gnu-elpa-mirror)

  :init
  (setq modus-themes-mixed-fonts t
        modus-themes-bold-constructs t
        modus-themes-italic-constructs t
        modus-themes-region '(no-extend)
        modus-themes-mode-line '(accented)
        modus-themes-prompts '(backgound bold intense)
        ;; modus-themes-hl-line 'accented
        modus-themes-intense-markup t
        modus-themes-region '(no-extend bg-only)
        modus-themes-subtle-line-numbers t
        modus-themes-fringes '(subtle)
        modus-themes-language-checkers '(straight-underline faint)
        modus-themes-org-blocks '(gray-background)

        modus-themes-completions
        '((matches . (bold background intense))
          (selection . (bold background intense))
          (popup . (accented))))

  (defun peremacs/call-modus-operandi ()
    (interactive)
    ;; heading backgrounds work better here
    (disable-theme 'modus-vivendi)
    (setq modus-themes-headings
          '((1 . (overline background variable-pitch bold 1.1))
            (2 . (overline background variable-pitch bold))
            (3 . (overline background variable-pitch semibold))
            (4 . (overline background variable-pitch semibold))
            (t . (overline variable-pitch semibold))))
    (modus-themes-load-operandi))

  (defun peremacs/call-modus-vivendi ()
    (interactive)
    (disable-theme 'modus-operandi)
    (setq modus-themes-headings
          '((1 . (overline monochrome variable-pitch bold 1.1))
            (2 . (overline monochrome variable-pitch bold))
            (3 . (overline monochrome variable-pitch semibold))
            (4 . (overline monochrome variable-pitch semibold))
            (t . (overline variable-pitch semibold))))
    (modus-themes-load-vivendi))


  ;; set semibold as the bold face
  ;; (for those fonts that provide this face)
  ;; (set-face-attribute 'bold nil :weight 'semibold)


  ;; :config
  ;; Load the theme files before enabling a theme
  (modus-themes-load-themes)

  ;; Load the theme of your choice:
  ;; (peremacs/call-modus-operandi)
  (peremacs/call-modus-vivendi)
)

```


#### <span class="section-num">11.2.3</span> Commentary {#commentary}

An elegant theme highlighting comments only

```emacs-lisp

(use-package commentary-theme
  ;;:config
  ;;(load-theme 'commentary t)
  )

```


#### <span class="section-num">11.2.4</span> My themes {#my-themes}

Neither of these work using `straight.el` or `use-package`, together
or separately (afaik). If these work, I could maybe add some more of
my own.

Forked from the [colorless-themes macro](https://github.com/lthms/colorless-themes). This includes my version of
the macro, original themes from Thomas Letan, and some additional
themes of my own that use this macro.

```emacs-lisp

(use-package colourless-themes
    :straight (:host gitlab :repo "peregrinator/colourless-themes-el")
    ;;:config
    ;;(load-theme 'beelzebub t)
    )

```


#### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5</span> unused {#unused}


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5.1</span> Wilmersdorf {#wilmersdorf}

I saw this on [doom-themes](https://github.com/hlissner/emacs-doom-themes) but I don't want to pull all of those just
for this, so installing from it's [GitHub](https://github.com/ianyepan/wilmersdorf-emacs-theme) using `straight.el`. But it
fails to load with `use-package` so I'm going to have to do it manually.

```emacs-lisp
(use-package wilmersdorf
  :straight (:host github :repo "ianyepan/wilmersdorf-emacs-theme")

  ;; :config
  ;; (load-theme 'wilmersdorf t)
  )
```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5.2</span> Tao {#tao}

Monochrome theme with minimal bold highlights and boxes?

```emacs-lisp
(use-package tao-theme
  :config
  ;; load theme
  (load-theme 'tao-yang t)
  ;; (load-theme 'tao-yin t)
  )
```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5.3</span> Expresso {#expresso}

```emacs-lisp
(use-package espresso-theme
    :straight (:host github :repo "dgutov/espresso-theme")
    ;;:config
    (load-theme 'espresso t)
    )
```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5.4</span> Github dark {#github-dark}

```emacs-lisp
(use-package github-dark-vscode-theme
  :config
  (load-theme 'github-dark-vscode t)

  ;; fixed upstream
  ;; unrelated but the cursor colour really needs improvement
  ;; (set-cursor-color "#ffffff")
  )
```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5.5</span> Github modern (light) {#github-modern--light}

```emacs-lisp
(use-package github-modern-theme
  :config
  (load-theme 'github-modern t)
  )
```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5.6</span> Vale {#vale}

```emacs-lisp
(use-package vale
  :straight (:type git :repo "https://codeberg.org/ext0l/vale.el")
  :config
  ;; (load-theme 'vale t)
  )
```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5.7</span> Parchment {#parchment}

Based on the screenshot of Haskell code on the [Pragmata Pro website](https://fsd.it/shop/fonts/pragmatapro/#tab-fb289adf-7c14-8).

```emacs-lisp
(use-package Parchment-theme
  :straight (:host github :repo "brihadeesh/emacs-parchment-theme")
  :config
  ;; (load-theme 'Parchment t)
  )
```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5.8</span> Almost mono {#almost-mono}

```emacs-lisp
(use-package almost-mono-themes
  :config
  ;; (load-theme 'almost-mono-black t)
  ;; (load-theme 'almost-mono-gray t)
  ;; (load-theme 'almost-mono-cream t)
  ;; (load-theme 'almost-mono-white t)
  )
```


##### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">11.2.5.9</span> Stimmung themes for nearly monochrome appearance {#stimmung-themes-for-nearly-monochrome-appearance}

```emacs-lisp
(use-package stimmung-themes
  ;; :straight (stimmung-themes :host github :repo "motform/stimmung-themes") ; if you are a straight shooter
  :config
  ;; (stimmung-themes-load-dark)
  )
```
