content-org/emacs/literate-emacs-configuration.org
** Highlighted line-mode

#+name: cursorline
#+begin_src emacs-lisp
  ;; cursorline
  (global-hl-line-mode 1)
#+end_src


** Solid window dividers

#+begin_src emacs-lisp
  ;; (setq window-divider-default-right-width 1)
  ;; (setq window-divider-default-bottom-width 1)
  ;; (setq window-divider-default-places 'all)
  ;; (window-divider-mode)
  (setq window-divider-default-right-width 1)
  (setq window-divider-default-bottom-width 1)
  (setq window-divider-default-places 'right-only)
  (add-hook 'after-init-hook #'window-divider-mode)
#+end_src


** Something about underlines

Underline line at descent position, not baseline position

#+begin_src emacs-lisp
  (setq x-underline-at-descent-line t)
#+end_src



** Cursor configuration

#+begin_src emacs-lisp
  (set-default 'cursor-type  '(bar . 2))
  (blink-cursor-mode 1)
#+end_src


** Line-number format

#+begin_src emacs-lisp
        (setq linum-format "%4d ")
  #+end_src


** Visual not audible bell

Flashes modeline for warnings from [[https://github.com/purcell/mode-line-bell][purcell]]

#+begin_src emacs-lisp
    ;; No sound
    (setq ring-bell-function 'ignore)

    (use-package mode-line-bell
      :config
      (mode-line-bell-mode))
#+end_src


** No Tooltips

#+begin_src emacs-lisp
  (tooltip-mode 0)
#+end_src


** Minibuffer appearance?

As per [[https://www.reddit.com/r/emacs/comments/rxa29k/is_it_possible_to_have_a_window_which_is_just_the/hrhvrqw/][Hamilton9508's comment]] he makes a single minibuffer-only frame
across the bottom of the Emacs window and so the rest of the frames
have only a single buffer (i.e. the buffer being edited/used) and no
minubuffer of it's own. Not sure if this will work for me but I'll
perhaps give it a shot.

#+begin_src emacs-lisp
  (setq minibuffer-frame-alist '(
              (name . "minibuf")
              (menu-bar-lines . 0)
              (vertical-scroll-bars . nil)
              (auto-raise . t)
              (sticky . t)
              (left . 0)
              (top . -1)
              (height . 1)
              (internal-border-width . 0)
              (minibuffer . only)))
#+end_src


** Minimalist and ordered mode-line

People seem to use packages for this. I've considered using the
[[https://github.com/seagle0128/doom-modeline][doom-modeline]] but it seems to be pretty heavy in terms of dependencies
and I'd like a mode-line with a much more fundamental interface
although it's still a good contender considering it's very simple to
configure. I'm also considering [[https://github.com/gexplorer/simple-modeline][simple-mode-line]].

*** Mood-line because I'm fucking tired

#+begin_src emacs-lisp
  (use-package mood-line
    :config
    (mood-line-mode)
    )
#+end_src


** Pulse to locate cursor with Protesilaos's pulsar

#+begin_src emacs-lisp

(use-package pulsar
  :straight (:host gitlab :repo "protesilaos/pulsar")

  :custom
  (pulsar-pulse-functions ; Read the doc string for why not `setq'
   '(recenter-top-bottom
     move-to-window-line-top-bottom
     reposition-window
     ;; bookmark-jump
     ;; other-window
     ;; delete-window
     ;; delete-other-windows
     forward-page
     backward-page
     scroll-up-command
     scroll-down-command
     ;; windmove-right
     ;; windmove-left
     ;; windmove-up
     ;; windmove-down
     ;; windmove-swap-states-right
     ;; windmove-swap-states-left
     ;; windmove-swap-states-up
     ;; windmove-swap-states-down
     ;; tab-new
     ;; tab-close
     ;; tab-next
     org-next-visible-heading
     org-previous-visible-heading
     org-forward-heading-same-level
     org-backward-heading-same-level
     outline-backward-same-level
     outline-forward-same-level
     outline-next-visible-heading
     outline-previous-visible-heading
     outline-up-heading))

  :config
  (setq pulsar-pulse-on-window-change t
	pulsar-pulse t
	pulsar-delay 0.055
	pulsar-iterations 10
	pulsar-face 'pulsar-cyan)

  (pulsar-global-mode 1)

  :bind
  (("C-c l" . pulsar-pulse-line)
   ("C-c h l" . pulsar-highlight-line))

  :hook
  (consult-after-jump . pulsar-recenter-top)
  (consult-after-jump . pulsar-reveal-entry))

#+end_src



** Display complex key-binding suggestions

#+begin_src emacs-lisp
  (use-package which-key
    :diminish which-key-mode
    :config
    (which-key-mode))
#+end_src



** Diminish for a cleaner modeline

 ~org-indent-mode~ doesn't get disabled by the default method.

 #+begin_src emacs-lisp
     (use-package diminish
       :diminish auto-fill-function
       :diminish flyspell-mode
       :diminish visual-line-mode
     )

   (defun peremacs/diminish-org-indent ()
       (interactive)
       (diminish 'org-indent-mode ""))
   (add-hook 'org-indent-mode-hook 'peremacs/diminish-org-indent)

 #+end_src


** Pixel scroll precision mode (Emacs 29+)

#+begin_src emacs-lisp
  (pixel-scroll-precision-mode +1)
#+end_src


** Make "Emacs" the *window title*

#+name: set-window-title
#+begin_src emacs-lisp
  (setq-default frame-title-format '("Emacs"))
#+end_src


** Make *scratch* buffer and *minibuffer* blank

#+name: blank-startup
#+begin_src emacs-lisp
  (setq initial-scratch-message "")
  (setq inhibit-startup-echo-area-message t)
  (setq inhibit-startup-message t)
  (setq initial-scratch-message nil)
#+end_src


** Show keystrokes

Stolen from [[https://github.com/karthink/emacs.d][Karthik Chikmaglur's emacs.d]]; shows what is typed immediately.

#+begin_src emacs-lisp
(setq echo-keystrokes 0.01)
#+end_src


* Window Management

** EXWM

This ofc *doesn't work* on wayland and =pgtk= emacs but am I willing
to learn C++ and emacs-lisp well enough to contribute to porting this
to wayland/wlroots or something?


#+begin_src emacs-lisp
  (use-package exwm
    ;; :ensure t

    :diminish

    :custom
    (exwm-workspace-number 4)

    ;; (defun exwm-start-process (command)
    ;;   "Start a process via a shell COMMAND."
    ;;   (interactive (list (read-shell-command "$ ")))
    ;;   (start-process-shell-command command nil command))

    ;; ((kbd "<s-return>") #'exwm-start-process)

    ;; (exwm-input-set-key (kbd "<s-return>") #'exwm-start-process)

    :config
    ;; This now has to be toggled separately in the `~/.xinitrc'
    ;; see https://www.reddit.com/r/emacs/comments/mjx2qd/conditional_loading_for_exwm_with_usepackage/gte7puu/
    (require 'exwm-config)
    ;; (exwm-config-default)

    ;; Effective use of EXWM requires the ability to return from char-mode to line-mode.
    ;; This will be performed with s-r.
    (exwm-input-set-key (kbd "s-r") #'exwm-reset)

    ;; Hide all windows except the current one.
    (exwm-input-set-key (kbd "s-o") #'delete-other-windows)

    ;; Close the current window and kill its buffer.
    (exwm-input-set-key (kbd "C-s-x") #'kill-buffer-and-window)

    ;; Close the current window without killing its buffer.
    (exwm-input-set-key (kbd "s-x") #'delete-window)

    ;; Open an Eshell buffer in the current buffer’s location.
    (exwm-input-set-key (kbd "C-z") #'eshell-find-eshell-here)

    ;;  Move point to the windows immediately around the current window.
    (exwm-input-set-key (kbd "s-h") #'windmove-left)
    (exwm-input-set-key (kbd "s-j") #'windmove-down)
    (exwm-input-set-key (kbd "s-k") #'windmove-up)
    (exwm-input-set-key (kbd "s-l") #'windmove-right)
    (exwm-input-set-key (kbd "s-w") #'exwm-workspace-switch))
#+end_src


