content/emacs/literate-emacs-configuration.md


### <span class="section-num">11.3</span> Highlighted line-mode {#highlighted-line-mode}

<a id="code-snippet--cursorline"></a>
```emacs-lisp
;; cursorline
(global-hl-line-mode 1)
```


### <span class="section-num">11.4</span> Solid window dividers {#solid-window-dividers}

```emacs-lisp
;; (setq window-divider-default-right-width 1)
;; (setq window-divider-default-bottom-width 1)
;; (setq window-divider-default-places 'all)
;; (window-divider-mode)
(setq window-divider-default-right-width 1)
(setq window-divider-default-bottom-width 1)
(setq window-divider-default-places 'right-only)
(add-hook 'after-init-hook #'window-divider-mode)
```


### <span class="section-num">11.5</span> Something about underlines {#something-about-underlines}

Underline line at descent position, not baseline position

```emacs-lisp
(setq x-underline-at-descent-line t)
```


### <span class="section-num">11.6</span> Cursor configuration {#cursor-configuration}

```emacs-lisp
(set-default 'cursor-type  '(bar . 2))
(blink-cursor-mode 1)
```


### <span class="section-num">11.7</span> Line-number format {#line-number-format}

```emacs-lisp
(setq linum-format "%4d ")
```


### <span class="section-num">11.8</span> Visual not audible bell {#visual-not-audible-bell}

Flashes modeline for warnings from [purcell](https://github.com/purcell/mode-line-bell)

```emacs-lisp
;; No sound
(setq ring-bell-function 'ignore)

(use-package mode-line-bell
  :config
  (mode-line-bell-mode))
```


### <span class="section-num">11.9</span> No Tooltips {#no-tooltips}

```emacs-lisp
(tooltip-mode 0)
```


### <span class="section-num">11.10</span> Minibuffer appearance? {#minibuffer-appearance}

As per [Hamilton9508's comment](https://www.reddit.com/r/emacs/comments/rxa29k/is_it_possible_to_have_a_window_which_is_just_the/hrhvrqw/) he makes a single minibuffer-only frame
across the bottom of the Emacs window and so the rest of the frames
have only a single buffer (i.e. the buffer being edited/used) and no
minubuffer of it's own. Not sure if this will work for me but I'll
perhaps give it a shot.

```emacs-lisp
(setq minibuffer-frame-alist '(
            (name . "minibuf")
            (menu-bar-lines . 0)
            (vertical-scroll-bars . nil)
            (auto-raise . t)
            (sticky . t)
            (left . 0)
            (top . -1)
            (height . 1)
            (internal-border-width . 0)
            (minibuffer . only)))
```


### <span class="section-num">11.11</span> Minimalist and ordered mode-line {#minimalist-and-ordered-mode-line}

People seem to use packages for this. I've considered using the
[doom-modeline](https://github.com/seagle0128/doom-modeline) but it seems to be pretty heavy in terms of dependencies
and I'd like a mode-line with a much more fundamental interface
although it's still a good contender considering it's very simple to
configure. I'm also considering [simple-mode-line](https://github.com/gexplorer/simple-modeline).


#### <span class="section-num">11.11.1</span> Mood-line because I'm fucking tired {#mood-line-because-i-m-fucking-tired}

```emacs-lisp
(use-package mood-line
  :config
  (mood-line-mode)
  )
```


### <span class="section-num">11.12</span> Pulse to locate cursor with Protesilaos's pulsar {#pulse-to-locate-cursor-with-protesilaos-s-pulsar}

```emacs-lisp

(use-package pulsar
  :straight (:host gitlab :repo "protesilaos/pulsar")

  :custom
  (pulsar-pulse-functions ; Read the doc string for why not `setq'
   '(recenter-top-bottom
     move-to-window-line-top-bottom
     reposition-window
     ;; bookmark-jump
     ;; other-window
     ;; delete-window
     ;; delete-other-windows
     forward-page
     backward-page
     scroll-up-command
     scroll-down-command
     ;; windmove-right
     ;; windmove-left
     ;; windmove-up
     ;; windmove-down
     ;; windmove-swap-states-right
     ;; windmove-swap-states-left
     ;; windmove-swap-states-up
     ;; windmove-swap-states-down
     ;; tab-new
     ;; tab-close
     ;; tab-next
     org-next-visible-heading
     org-previous-visible-heading
     org-forward-heading-same-level
     org-backward-heading-same-level
     outline-backward-same-level
     outline-forward-same-level
     outline-next-visible-heading
     outline-previous-visible-heading
     outline-up-heading))

  :config
  (setq pulsar-pulse-on-window-change t
        pulsar-pulse t
        pulsar-delay 0.055
        pulsar-iterations 10
        pulsar-face 'pulsar-cyan)

  (pulsar-global-mode 1)

  :bind
  (("C-c l" . pulsar-pulse-line)
   ("C-c h l" . pulsar-highlight-line))

  :hook
  (consult-after-jump . pulsar-recenter-top)
  (consult-after-jump . pulsar-reveal-entry))

```


### <span class="section-num">11.13</span> Display complex key-binding suggestions {#display-complex-key-binding-suggestions}

```emacs-lisp
(use-package which-key
  :diminish which-key-mode
  :config
  (which-key-mode))
```


### <span class="section-num">11.14</span> Diminish for a cleaner modeline {#diminish-for-a-cleaner-modeline}

`org-indent-mode` doesn't get disabled by the default method.

```emacs-lisp
  (use-package diminish
    :diminish auto-fill-function
    :diminish flyspell-mode
    :diminish visual-line-mode
  )

(defun peremacs/diminish-org-indent ()
    (interactive)
    (diminish 'org-indent-mode ""))
(add-hook 'org-indent-mode-hook 'peremacs/diminish-org-indent)

```


### <span class="section-num">11.15</span> Pixel scroll precision mode (Emacs 29+) {#pixel-scroll-precision-mode--emacs-29-plus}

```emacs-lisp
(pixel-scroll-precision-mode +1)
```


### <span class="section-num">11.16</span> Make "Emacs" the **window title** {#make-emacs-the-window-title}

<a id="code-snippet--set-window-title"></a>
```emacs-lisp
(setq-default frame-title-format '("Emacs"))
```


### <span class="section-num">11.17</span> Make **scratch** buffer and **minibuffer** blank {#make-scratch-buffer-and-minibuffer-blank}

<a id="code-snippet--blank-startup"></a>
```emacs-lisp
(setq initial-scratch-message "")
(setq inhibit-startup-echo-area-message t)
(setq inhibit-startup-message t)
(setq initial-scratch-message nil)
```


### <span class="section-num">11.18</span> Show keystrokes {#show-keystrokes}

Stolen from [Karthik Chikmaglur's emacs.d](https://github.com/karthink/emacs.d); shows what is typed immediately.

```emacs-lisp
(setq echo-keystrokes 0.01)
```


## <span class="section-num">12</span> Window Management {#window-management}


### <span class="section-num">12.1</span> EXWM {#exwm}

This ofc **doesn't work** on wayland and `pgtk` emacs but am I willing
to learn C++ and emacs-lisp well enough to contribute to porting this
to wayland/wlroots or something?

```emacs-lisp
(use-package exwm
  ;; :ensure t

  :diminish

  :custom
  (exwm-workspace-number 4)

  ;; (defun exwm-start-process (command)
  ;;   "Start a process via a shell COMMAND."
  ;;   (interactive (list (read-shell-command "$ ")))
  ;;   (start-process-shell-command command nil command))

  ;; ((kbd "<s-return>") #'exwm-start-process)

  ;; (exwm-input-set-key (kbd "<s-return>") #'exwm-start-process)

  :config
  ;; This now has to be toggled separately in the `~/.xinitrc'
  ;; see https://www.reddit.com/r/emacs/comments/mjx2qd/conditional_loading_for_exwm_with_usepackage/gte7puu/
  (require 'exwm-config)
  ;; (exwm-config-default)

  ;; Effective use of EXWM requires the ability to return from char-mode to line-mode.
  ;; This will be performed with s-r.
  (exwm-input-set-key (kbd "s-r") #'exwm-reset)

  ;; Hide all windows except the current one.
  (exwm-input-set-key (kbd "s-o") #'delete-other-windows)

  ;; Close the current window and kill its buffer.
  (exwm-input-set-key (kbd "C-s-x") #'kill-buffer-and-window)

  ;; Close the current window without killing its buffer.
  (exwm-input-set-key (kbd "s-x") #'delete-window)

  ;; Open an Eshell buffer in the current buffer’s location.
  (exwm-input-set-key (kbd "C-z") #'eshell-find-eshell-here)

  ;;  Move point to the windows immediately around the current window.
  (exwm-input-set-key (kbd "s-h") #'windmove-left)
  (exwm-input-set-key (kbd "s-j") #'windmove-down)
  (exwm-input-set-key (kbd "s-k") #'windmove-up)
  (exwm-input-set-key (kbd "s-l") #'windmove-right)
  (exwm-input-set-key (kbd "s-w") #'exwm-workspace-switch))
```
