content-org/emacs/literate-emacs-configuration.org
** Workspaces with perspective-el

Independent workspaces for different projects like profiles on RStudio
but perhaps a lot more dynamic. This might need more work hence adding
[[https://github.com/nex3/perspective-el][a link to the project page]] here.

#+begin_src emacs-lisp
  (use-package perspective
    :demand t

    :init
    ;; apparently it's essential to define a prefix on Emacs=28
    (setq persp-mode-prefix-key (kbd "C-x x"))

    :bind
    ;; these work with selectrum/vertico i.e. `completing-read'
    ;; type completion systems that are appararently closer to
    ;; base Emacs functioning.
    (("C-x b" . persp-switch-to-buffer*)
     ;;("C-x k" . persp-kill-buffer*)
    )

    :config
    ;; Running `persp-mode' multiple times resets the perspective list...
  (unless (equal (default-value 'persp-mode) t)
    (persp-mode 1)))
#+end_src

*** persp-projectile for proper workspace window management

#+begin_src emacs-lisp
    (use-package persp-projectile
      :bind
      ("C-x x s". persp-projectile-switch-project))
#+end_src


** Undo disrupted window/frame arrangement after using some shit

Stolen from [[https://github.com/karthink/emacs.d][Karthik Chikmaglur's emacs.d]]

#+begin_src emacs-lisp
  (use-package winner
    :disabled
    :commands winner-undo
    :bind (("C-x C-/" . winner-undo)
           ("s-/" . winner-undo)
           ("s-S-/" . winner-redo))
    :config
    (winner-mode +1))
#+end_src


** Ace-window helps with navigation between multiple windows

Simpler navigation between open Emacs windows

#+begin_src emacs-lisp
  (use-package ace-window

    :init
    (setq aw-keys '(?a ?s ?d ?f ?j ?k ?l ?o))

    :bind (("C-x o" . ace-window)
           ("M-o" . other-window)
           ("M-o" . ace-window))

    :diminish ace-window-mode)
#+end_src


**** TODO Other actions that ~ace-window~ handles:

#+begin_src emacs-lisp :tangle no
  (defvar aw-dispatch-alist
  '((?x aw-delete-window "Delete Window")
	(?m aw-swap-window "Swap Windows")
	(?M aw-move-window "Move Window")
	(?c aw-copy-window "Copy Window")
	(?j aw-switch-buffer-in-window "Select Buffer")
	(?n aw-flip-window)
	(?u aw-switch-buffer-other-window "Switch Buffer Other Window")
	(?c aw-split-window-fair "Split Fair Window")
	(?v aw-split-window-vert "Split Vert Window")
	(?b aw-split-window-horz "Split Horz Window")
	(?o delete-other-windows "Delete Other Windows")
	(?? aw-show-dispatch-help))
  "List of actions for `aw-dispatch-default'.")
#+end_src


** TODO Sane native window management
:PROPERTIES:
:header-args: :tangle no
:END:

Focuses new windows when created.

#+begin_src emacs-lisp
  ;; Window management
  ;; focus new windows once created
  (use-package window
    :straight (:type 'built-in)
    :bind (("C-x 3" . hsplit-last-buffer)
           ("C-x 2" . vsplit-last-buffer))
    :preface
    (defun hsplit-last-buffer ()
      "Gives the focus to the last created horizontal window."
      (interactive)
      (split-window-horizontally)
      (other-window 1))

    (defun vsplit-last-buffer ()
      "Gives the focus to the last created vertical window."
      (interactive)
      (split-window-vertically)
      (other-window 1)))
  #+end_src


** Better popups with popper

#+begin_src emacs-lisp
  (use-package popper
      :bind (("C-`"   . popper-toggle-latest)
             ("M-`"   . popper-cycle)
             ("C-M-`" . popper-toggle-type))

      :init
      ;; assign windows to popper (to appear as popups)
      (setq popper-reference-buffers
            '("\\*Messages\\*"
              "Output\\*$"
              "\\*Backtrace\\*"
              "\\*Warnings\\*"
              "^Calc:"
              "^\\*ielm\\*"
              ;; terminals as popups
              "^\\*eshell.*\\*$" eshell-mode
              "^\\*shell.*\\*$" shell-mode
              "^\\*term.*\\*$" term-mode
              "^\\*vterm.*\\*$" vterm-mode
              help-mode
              compilation-mode
              ;; magit stuff
              "^magit:*" magit-mode
              "^\\*Ilist\\*$"
              ;; R console that comes with ESS
              "^\\*iESS" iESS-mode
              "^\\*R\\*"
              ;; R-help windows
              "^\\*help\\[R\\]([a-z]*)\\*"
              ))

      ;;grouping popups by projectile groups
      (setq popper-group-function #'popper-group-by-projectile)

      ;; popper UI configguration
      (setq popper-modeline nil)

      (popper-mode +1)
      ;; echo area hints?
      (popper-echo-mode +1)
      )
#+end_src



* Garbage


*** from customize API

  This keeps the init.el cleaner and without junk from =customize.el=
  API allows for an option to gitignore your =custom.el= cause it's
  junk.

  #+name: customize-disable
  #+begin_src emacs-lisp

      ;; Offload the custom-set-variables to a separate file
      ;; (setq custom-file "~/.emacs.d/custom.el")
      (setq custom-file (concat user-emacs-directory "/custom.el"))
      (unless (file-exists-p custom-file)
        (write-region "" nil custom-file))

    ;; Load custom file. Don't hide errors. Hide success message
    ;; OR DON'T EVEN BOTHER WITH IT
    ;; (load custom-file nil t)

   #+end_src


*** from backups and autosaves(?)

  #+name: organise-junk
  #+begin_src emacs-lisp
    ;;; Put Emacs auto-save and backup files to one folder
    (defconst emacs-tmp-dir (expand-file-name (format "emacs%d" (user-uid)) temporary-file-directory))

    (setq
     backup-by-copying t                                        ; Avoid symlinks
     delete-old-versions t
     kept-new-versions 6
     kept-old-versions 2
     version-control t
     auto-save-list-file-prefix emacs-tmp-dir
     auto-save-file-name-transforms `((".*" ,emacs-tmp-dir t))  ; Change autosave dir to tmp
     backup-directory-alist `((".*" . ,emacs-tmp-dir)))

    ;;; Lockfiles unfortunately cause more pain than benefit
    (setq create-lockfiles nil)
   #+end_src



* Defaults

Primarily bootlegged from [[https://sanemacs.com][Sanemacs]] and changed when appropriate (and
when I thought I understood what I was doing)


** Disable native popups(?) and bell

#+begin_src emacs-lisp
  ;; not sure what this is about
  ;; (setq-default indent-tabs-mode nil)
  ;; disable popups?
  ;; (setq pop-up-windows nil)
  ;; Disable bell sound
  (setq ring-bell-function 'ignore)
#+end_src


** Only *y or n prompts* for speed

Apparently there is a ~short-answers~ variable

#+begin_src emacs-lisp
  ;; (fset 'yes-or-no-p 'y-or-n-p)

  (setq-default
   use-short-answers t

   ;; Ok to visit non existent files (no confirmation reqd)
   confirm-nonexistent-file-or-buffer nil)
#+end_src


** Merge Emacs and system clipboards

#+begin_src emacs-lisp
;; Merge system's and Emacs' clipboard
(setq-default select-enable-clipboard t)
#+end_src


** Overwrite selected text

#+name: overwrite-active-region
#+begin_src emacs-lisp
  (delete-selection-mode 1)
#+end_src


** Join line to following line

Plagiarised from [[https://pragmaticemacs.com/emacs/join-line-to-following-line/][pragmatic emacs]]. For the reverse, emacs has a
slightly obscurely named command =delete-indentation= which is bound
to =M-^= which can be rather useful. From the help for the function
(which you can always look up using =C-h k M-^= or =C-h f
delete-indentation=)

#+name: concatenate-following-line
#+begin_src emacs-lisp
  ;; join line to next line
  (global-set-key (kbd "C-j")
              (lambda ()
                    (interactive)
                    (join-line -1)))
#+end_src


