content/emacs/literate-emacs-configuration.md


### <span class="section-num">12.2</span> Workspaces with perspective-el {#workspaces-with-perspective-el}

Independent workspaces for different projects like profiles on RStudio
but perhaps a lot more dynamic. This might need more work hence adding
[a link to the project page](https://github.com/nex3/perspective-el) here.

```emacs-lisp
(use-package perspective
  :demand t

  :init
  ;; apparently it's essential to define a prefix on Emacs=28
  (setq persp-mode-prefix-key (kbd "C-x x"))

  :bind
  ;; these work with selectrum/vertico i.e. `completing-read'
  ;; type completion systems that are appararently closer to
  ;; base Emacs functioning.
  (("C-x b" . persp-switch-to-buffer*)
   ;;("C-x k" . persp-kill-buffer*)
  )

  :config
  ;; Running `persp-mode' multiple times resets the perspective list...
(unless (equal (default-value 'persp-mode) t)
  (persp-mode 1)))
```


#### <span class="section-num">12.2.1</span> persp-projectile for proper workspace window management {#persp-projectile-for-proper-workspace-window-management}

```emacs-lisp
(use-package persp-projectile
  :bind
  ("C-x x s". persp-projectile-switch-project))
```


### <span class="section-num">12.3</span> Undo disrupted window/frame arrangement after using some shit {#undo-disrupted-window-frame-arrangement-after-using-some-shit}

Stolen from [Karthik Chikmaglur's emacs.d](https://github.com/karthink/emacs.d)

```emacs-lisp
(use-package winner
  :disabled
  :commands winner-undo
  :bind (("C-x C-/" . winner-undo)
         ("s-/" . winner-undo)
         ("s-S-/" . winner-redo))
  :config
  (winner-mode +1))
```


### <span class="section-num">12.4</span> Ace-window helps with navigation between multiple windows {#ace-window-helps-with-navigation-between-multiple-windows}

Simpler navigation between open Emacs windows

```emacs-lisp
(use-package ace-window

  :init
  (setq aw-keys '(?a ?s ?d ?f ?j ?k ?l ?o))

  :bind (("C-x o" . ace-window)
         ("M-o" . other-window)
         ("M-o" . ace-window))

  :diminish ace-window-mode)
```


##### <span class="org-todo todo TODO">TODO</span> <span class="section-num">12.4.0.1</span> Other actions that `ace-window` handles: {#other-actions-that-ace-window-handles}

```emacs-lisp
(defvar aw-dispatch-alist
'((?x aw-delete-window "Delete Window")
      (?m aw-swap-window "Swap Windows")
      (?M aw-move-window "Move Window")
      (?c aw-copy-window "Copy Window")
      (?j aw-switch-buffer-in-window "Select Buffer")
      (?n aw-flip-window)
      (?u aw-switch-buffer-other-window "Switch Buffer Other Window")
      (?c aw-split-window-fair "Split Fair Window")
      (?v aw-split-window-vert "Split Vert Window")
      (?b aw-split-window-horz "Split Horz Window")
      (?o delete-other-windows "Delete Other Windows")
      (?? aw-show-dispatch-help))
"List of actions for `aw-dispatch-default'.")
```


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">12.5</span> Sane native window management {#sane-native-window-management}

Focuses new windows when created.

```emacs-lisp
;; Window management
;; focus new windows once created
(use-package window
  :straight (:type 'built-in)
  :bind (("C-x 3" . hsplit-last-buffer)
         ("C-x 2" . vsplit-last-buffer))
  :preface
  (defun hsplit-last-buffer ()
    "Gives the focus to the last created horizontal window."
    (interactive)
    (split-window-horizontally)
    (other-window 1))

  (defun vsplit-last-buffer ()
    "Gives the focus to the last created vertical window."
    (interactive)
    (split-window-vertically)
    (other-window 1)))
```


### <span class="section-num">12.6</span> Better popups with popper {#better-popups-with-popper}

```emacs-lisp
(use-package popper
    :bind (("C-`"   . popper-toggle-latest)
           ("M-`"   . popper-cycle)
           ("C-M-`" . popper-toggle-type))

    :init
    ;; assign windows to popper (to appear as popups)
    (setq popper-reference-buffers
          '("\\*Messages\\*"
            "Output\\*$"
            "\\*Backtrace\\*"
            "\\*Warnings\\*"
            "^Calc:"
            "^\\*ielm\\*"
            ;; terminals as popups
            "^\\*eshell.*\\*$" eshell-mode
            "^\\*shell.*\\*$" shell-mode
            "^\\*term.*\\*$" term-mode
            "^\\*vterm.*\\*$" vterm-mode
            help-mode
            compilation-mode
            ;; magit stuff
            "^magit:*" magit-mode
            "^\\*Ilist\\*$"
            ;; R console that comes with ESS
            "^\\*iESS" iESS-mode
            "^\\*R\\*"
            ;; R-help windows
            "^\\*help\\[R\\]([a-z]*)\\*"
            ))

    ;;grouping popups by projectile groups
    (setq popper-group-function #'popper-group-by-projectile)

    ;; popper UI configguration
    (setq popper-modeline nil)

    (popper-mode +1)
    ;; echo area hints?
    (popper-echo-mode +1)
    )
```


## <span class="section-num">13</span> Garbage {#garbage}


#### <span class="section-num">13.0.1</span> from customize API {#from-customize-api}

This keeps the init.el cleaner and without junk from `customize.el`
API allows for an option to gitignore your `custom.el` cause it's
junk.

<a id="code-snippet--customize-disable"></a>
```emacs-lisp

  ;; Offload the custom-set-variables to a separate file
  ;; (setq custom-file "~/.emacs.d/custom.el")
  (setq custom-file (concat user-emacs-directory "/custom.el"))
  (unless (file-exists-p custom-file)
    (write-region "" nil custom-file))

;; Load custom file. Don't hide errors. Hide success message
;; OR DON'T EVEN BOTHER WITH IT
;; (load custom-file nil t)

```


#### <span class="section-num">13.0.2</span> from backups and autosaves(?) {#from-backups-and-autosaves}

<a id="code-snippet--organise-junk"></a>
```emacs-lisp
;;; Put Emacs auto-save and backup files to one folder
(defconst emacs-tmp-dir (expand-file-name (format "emacs%d" (user-uid)) temporary-file-directory))

(setq
 backup-by-copying t                                        ; Avoid symlinks
 delete-old-versions t
 kept-new-versions 6
 kept-old-versions 2
 version-control t
 auto-save-list-file-prefix emacs-tmp-dir
 auto-save-file-name-transforms `((".*" ,emacs-tmp-dir t))  ; Change autosave dir to tmp
 backup-directory-alist `((".*" . ,emacs-tmp-dir)))

;;; Lockfiles unfortunately cause more pain than benefit
(setq create-lockfiles nil)
```


## <span class="section-num">14</span> Defaults {#defaults}

Primarily bootlegged from [Sanemacs](https://sanemacs.com) and changed when appropriate (and
when I thought I understood what I was doing)


### <span class="section-num">14.1</span> Disable native popups(?) and bell {#disable-native-popups-----and-bell}

```emacs-lisp
;; not sure what this is about
;; (setq-default indent-tabs-mode nil)
;; disable popups?
;; (setq pop-up-windows nil)
;; Disable bell sound
(setq ring-bell-function 'ignore)
```


### <span class="section-num">14.2</span> Only **y or n prompts** for speed {#only-y-or-n-prompts-for-speed}

Apparently there is a `short-answers` variable

```emacs-lisp
;; (fset 'yes-or-no-p 'y-or-n-p)

(setq-default
 use-short-answers t

 ;; Ok to visit non existent files (no confirmation reqd)
 confirm-nonexistent-file-or-buffer nil)
```


### <span class="section-num">14.3</span> Merge Emacs and system clipboards {#merge-emacs-and-system-clipboards}

```emacs-lisp
;; Merge system's and Emacs' clipboard
(setq-default select-enable-clipboard t)
```


### <span class="section-num">14.4</span> Overwrite selected text {#overwrite-selected-text}

<a id="code-snippet--overwrite-active-region"></a>
```emacs-lisp
(delete-selection-mode 1)
```


### <span class="section-num">14.5</span> Join line to following line {#join-line-to-following-line}

Plagiarised from [pragmatic emacs](https://pragmaticemacs.com/emacs/join-line-to-following-line/). For the reverse, emacs has a
slightly obscurely named command `delete-indentation` which is bound
to `M-^` which can be rather useful. From the help for the function
(which you can always look up using `C-h k M-^` or `C-h f
delete-indentation`)

<a id="code-snippet--concatenate-following-line"></a>
```emacs-lisp
;; join line to next line
(global-set-key (kbd "C-j")
            (lambda ()
                  (interactive)
                  (join-line -1)))
```
