content-org/emacs/literate-emacs-configuration.org
** Simpler kill buffer behaviour

#+name: buffer-killer
#+begin_src emacs-lisp
  (defun peremacs/kill-this-buffer ()
    (interactive) (kill-buffer (current-buffer)))
  (global-set-key (kbd "C-x k") 'peremacs/kill-this-buffer)
#+end_src


** Kill without accessing clipboard - reassess if this is really necessary

#+begin_src emacs-lisp
  (defun peremacs/backward-kill-word ()
    (interactive "*")
    (push-mark)
    (backward-word)
    (delete-region (point) (mark)))

  (global-set-key (kbd "M-DEL") 'peremacs/backward-kill-word)
  (global-set-key (kbd "C-DEL") 'peremacs/backward-kill-word)
#+end_src


** Return to last position in buffer

Opens files at last position used. Something about this on [[https://www.emacswiki.org/emacs/SavePlace][Emacs Wiki]]

#+name: save-place
#+begin_src emacs-lisp
  (save-place-mode 1)
#+end_src


** Prompt before closing Emacs

#+begin_src emacs-lisp
;; Confirm when killing Emacs
(setq confirm-kill-emacs (lambda (prompt)
                           (y-or-n-p-with-timeout prompt 2 nil)))
#+end_src


** Prevent angle braces from throwing errors
#+begin_src emacs-lisp
(modify-syntax-entry ?< ".")
(modify-syntax-entry ?> ".")
#+end_src


** DISABLED Don't follow symlinks
:PROPERTIES:
:HEADER_ARGS: tangle no
:VISIBILITY: folded
:END:

#+begin_src emacs-lisp
  ;; don't follow symlinks? hopefully this solves the
  ;; `symbols function definition is void: org-file-name-concat' error
  (setq vc-follow-symlinks nil)
#+end_src


* Code utilities


** TODO Templates and snippets with minad's tempel

Seems a lot simpler than yasnippet but will have to work on templates.

#+begin_src emacs-lisp
  (use-package tempel
    ;; Require trigger prefix before template name when completing.
    ;; :custom
    ;; (tempel-trigger-prefix "<")

    :bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
           ("M-*" . tempel-insert))
#+end_src


Configuration: I'm setting the =tempel-path= because it defaults to
=~/.config/emacs/templates= which I don't use. But I think I'll
eventually switch to something like that.

#+begin_src emacs-lisp
  :init
(setq tempel-path "~/.emacs.d/templates")
#+end_src


Setup completion at point

#+begin_src emacs-lisp
  (defun tempel-setup-capf ()
    ;; Add the Tempel Capf to `completion-at-point-functions'.
    ;; `tempel-expand' only triggers on exact matches. Alternatively use
    ;; `tempel-complete' if you want to see all matches, but then you
    ;; should also configure `tempel-trigger-prefix', such that Tempel
    ;; does not trigger too often when you don't expect it. NOTE: We add
    ;; `tempel-expand' *before* the main programming mode Capf, such
    ;; that it will be tried first.
    (setq-local completion-at-point-functions
                (cons #'tempel-expand
                      completion-at-point-functions)))
#+end_src


Hooks

#+begin_src emacs-lisp
  :hook
  (prog-mode . tempel-setup-capf)
  (text-mode . tempel-setup-capf)

      ;; Optionally make the Tempel templates available to Abbrev,
      ;; either locally or globally. `expand-abbrev' is bound to C-x '.
      ;; (add-hook 'prog-mode-hook #'tempel-abbrev-mode)
      ;; (global-tempel-abbrev-mode)
      )
#+end_src


** Snippets

#+begin_src emacs-lisp
  (use-package yasnippet
    :disabled
    :config
    (yas-global-mode 1)
    :diminish yas-minor-mode)
#+end_src


** Syntax checking with Flycheck

#+begin_src emacs-lisp
  (use-package flycheck
    :defer t
    :hook
    (prog-mode . flycheck-mode)
    (org-mode . flycheck-mode)
    (sh-mode . flycheck-mode)
    :diminish flycheck-mode
    )
#+end_src


** Bash - use tabs instead of spaces

Maybe this needs to be universal but this is especially annoying when
I edit void-packages 'template's which specifically need tabs in the
custom functions below.

#+begin_src emacs-lisp
  (add-hook 'sh-mode-hook
      (lambda ()
          (setq-default indent-tabs-mode t)
          (setq-default tab-width 8)
      (add-to-list 'write-file-functions 'delete-trailing-whitespace)))
#+end_src


** Auto-paired parens

#+begin_src emacs-lisp
  (electric-pair-mode 1)
  (setq electric-pair-preserve-balance nil)
#+end_src


** Show matching parens

#+begin_src emacs-lisp
  (show-paren-mode 1)
  ;; Worst possible setting with this theme - it sucks balls
  ;; (setq show-paren-style 'expression)
#+end_src



** CUA mode

#+begin_src emacs-lisp
  (setq cua-enable-cua-keys nil)
  ;; for rectangles, CUA is nice
  (cua-mode t)
#+end_src


** Aggressive *indentation* coz OCD

...and I hate doing it manually and Emacs usually refuses to do it by
itself

#+begin_src emacs-lisp
  (use-package aggressive-indent
    :config (global-aggressive-indent-mode 1)
    :diminish aggressive-indent-mode)
#+end_src


** Bug-hunter

...except those that you can eat

#+begin_src emacs-lisp
  (use-package bug-hunter)
#+end_src


** cl-libify

Convert all (deperecated) =cl= symbols to =cl-lib=

#+begin_src emacs-lisp
  (use-package cl-libify
    :disabled)
#+end_src


** Iedit

A more intuitive way to alter all the occurrences of a word/keyword at once

#+begin_src emacs-lisp
  (use-package iedit)
#+end_src


** Show line numbers in programming modes

#+name: linum-for-progmode
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook
                  (if (and (fboundp 'display-line-numbers-mode) (display-graphic-p))
                      #'display-line-numbers-mode
                    #'linum-mode))
#+end_src


** Files from script directories default to shell-mode

Scope for adding more such shit?

#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("/bin/" . sh-mode))
  (add-to-list 'auto-mode-alist '("/srcpkgs/[[:ascii:]]+/template" . sh-mode))
#+end_src


** Editing root files & privelege escalation for TRAMP if I ever use it

#+begin_src emacs-lisp
    (use-package su
      ;; :config
      ;; (su-mode +1)
      )
#+end_src



** Whitespace mopup

#+name: del-whitespace
#+begin_src emacs-lisp
      (add-hook 'before-save-hook
                'delete-trailing-whitespace) ;; Delete trailing whitespace on save
#+end_src


** Multiple cursors

This is like =C-v=, a visual mode in vim/neovim. I stole this from
[[https://pragmaticemacs.com/emacs/multiple-cursors/][pragmatic emacs]].

#+name: multiple-cursors
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c m c") 'peremacs/edit-lines)
#+end_src


** Delete blank lines and whitespace interactively

Plagiarised from [[https://pragmaticemacs.com/emacs/delete-blank-lines-and-shrink-whitespace/][pragmatic emacs]]

#+name: shrink-whitespace
#+begin_src emacs-lisp
  (global-set-key (kbd "M-SPC") 'shrink-whitespace)
#+end_src


** Autoupdate buffer if files has changed on disk

#+name: reload-buffer-on-modification
#+begin_src emacs-lisp
    (global-auto-revert-mode t)
#+end_src


* Languages


** Vimscript for editing neovim init

...cause neovim sucks and I don't like leaving Emacs in the ideal
case. I might end up replacing this with a *lua config*

#+begin_src emacs-lisp
  ;; vimrc syntax
  (use-package vimrc-mode)
  ;; :ensure t
  (add-to-list 'auto-mode-alist '("\\.vim\\(rc\\)?\\'" . vimrc-mode))
#+end_src


** Lua mode?

I intend to learn and use lua for my neovim config.

#+begin_src emacs-lisp
  (use-package lua-mode)
#+end_src


