content/emacs/literate-emacs-configuration.md


### <span class="section-num">14.6</span> Simpler kill buffer behaviour {#simpler-kill-buffer-behaviour}

<a id="code-snippet--buffer-killer"></a>
```emacs-lisp
(defun peremacs/kill-this-buffer ()
  (interactive) (kill-buffer (current-buffer)))
(global-set-key (kbd "C-x k") 'peremacs/kill-this-buffer)
```


### <span class="section-num">14.7</span> Kill without accessing clipboard - reassess if this is really necessary {#kill-without-accessing-clipboard-reassess-if-this-is-really-necessary}

```emacs-lisp
(defun peremacs/backward-kill-word ()
  (interactive "*")
  (push-mark)
  (backward-word)
  (delete-region (point) (mark)))

(global-set-key (kbd "M-DEL") 'peremacs/backward-kill-word)
(global-set-key (kbd "C-DEL") 'peremacs/backward-kill-word)
```


### <span class="section-num">14.8</span> Return to last position in buffer {#return-to-last-position-in-buffer}

Opens files at last position used. Something about this on [Emacs Wiki](https://www.emacswiki.org/emacs/SavePlace)

<a id="code-snippet--save-place"></a>
```emacs-lisp
(save-place-mode 1)
```


### <span class="section-num">14.9</span> Prompt before closing Emacs {#prompt-before-closing-emacs}

```emacs-lisp
;; Confirm when killing Emacs
(setq confirm-kill-emacs (lambda (prompt)
                           (y-or-n-p-with-timeout prompt 2 nil)))
```


### <span class="section-num">14.10</span> Prevent angle braces from throwing errors {#prevent-angle-braces-from-throwing-errors}

```emacs-lisp
(modify-syntax-entry ?< ".")
(modify-syntax-entry ?> ".")
```


### <span class="org-todo done DISABLED">DISABLED</span> <span class="section-num">14.11</span> Don't follow symlinks {#don-t-follow-symlinks}

```emacs-lisp
;; don't follow symlinks? hopefully this solves the
;; `symbols function definition is void: org-file-name-concat' error
(setq vc-follow-symlinks nil)
```


## <span class="section-num">15</span> Code utilities {#code-utilities}


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">15.1</span> Templates and snippets with minad's tempel {#templates-and-snippets-with-minad-s-tempel}

Seems a lot simpler than yasnippet but will have to work on templates.

```emacs-lisp
(use-package tempel
  ;; Require trigger prefix before template name when completing.
  ;; :custom
  ;; (tempel-trigger-prefix "<")

  :bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
         ("M-*" . tempel-insert))
```

Configuration: I'm setting the `tempel-path` because it defaults to
`~/.config/emacs/templates` which I don't use. But I think I'll
eventually switch to something like that.

```emacs-lisp
  :init
(setq tempel-path "~/.emacs.d/templates")
```

Setup completion at point

```emacs-lisp
(defun tempel-setup-capf ()
  ;; Add the Tempel Capf to `completion-at-point-functions'.
  ;; `tempel-expand' only triggers on exact matches. Alternatively use
  ;; `tempel-complete' if you want to see all matches, but then you
  ;; should also configure `tempel-trigger-prefix', such that Tempel
  ;; does not trigger too often when you don't expect it. NOTE: We add
  ;; `tempel-expand' *before* the main programming mode Capf, such
  ;; that it will be tried first.
  (setq-local completion-at-point-functions
              (cons #'tempel-expand
                    completion-at-point-functions)))
```

Hooks

```emacs-lisp
:hook
(prog-mode . tempel-setup-capf)
(text-mode . tempel-setup-capf)

    ;; Optionally make the Tempel templates available to Abbrev,
    ;; either locally or globally. `expand-abbrev' is bound to C-x '.
    ;; (add-hook 'prog-mode-hook #'tempel-abbrev-mode)
    ;; (global-tempel-abbrev-mode)
    )
```


### <span class="section-num">15.2</span> Snippets {#snippets}

```emacs-lisp
(use-package yasnippet
  :disabled
  :config
  (yas-global-mode 1)
  :diminish yas-minor-mode)
```


### <span class="section-num">15.3</span> Syntax checking with Flycheck {#syntax-checking-with-flycheck}

```emacs-lisp
(use-package flycheck
  :defer t
  :hook
  (prog-mode . flycheck-mode)
  (org-mode . flycheck-mode)
  (sh-mode . flycheck-mode)
  :diminish flycheck-mode
  )
```


### <span class="section-num">15.4</span> Bash - use tabs instead of spaces {#bash-use-tabs-instead-of-spaces}

Maybe this needs to be universal but this is especially annoying when
I edit void-packages 'template's which specifically need tabs in the
custom functions below.

```emacs-lisp
(add-hook 'sh-mode-hook
    (lambda ()
        (setq-default indent-tabs-mode t)
        (setq-default tab-width 8)
    (add-to-list 'write-file-functions 'delete-trailing-whitespace)))
```


### <span class="section-num">15.5</span> Auto-paired parens {#auto-paired-parens}

```emacs-lisp
(electric-pair-mode 1)
(setq electric-pair-preserve-balance nil)
```


### <span class="section-num">15.6</span> Show matching parens {#show-matching-parens}

```emacs-lisp
(show-paren-mode 1)
;; Worst possible setting with this theme - it sucks balls
;; (setq show-paren-style 'expression)
```


### <span class="section-num">15.7</span> CUA mode {#cua-mode}

```emacs-lisp
(setq cua-enable-cua-keys nil)
;; for rectangles, CUA is nice
(cua-mode t)
```


### <span class="section-num">15.8</span> Aggressive **indentation** coz OCD {#aggressive-indentation-coz-ocd}

...and I hate doing it manually and Emacs usually refuses to do it by
itself

```emacs-lisp
(use-package aggressive-indent
  :config (global-aggressive-indent-mode 1)
  :diminish aggressive-indent-mode)
```


### <span class="section-num">15.9</span> Bug-hunter {#bug-hunter}

...except those that you can eat

```emacs-lisp
(use-package bug-hunter)
```


### <span class="section-num">15.10</span> cl-libify {#cl-libify}

Convert all (deperecated) `cl` symbols to `cl-lib`

```emacs-lisp
(use-package cl-libify
  :disabled)
```


### <span class="section-num">15.11</span> Iedit {#iedit}

A more intuitive way to alter all the occurrences of a word/keyword at once

```emacs-lisp
(use-package iedit)
```


### <span class="section-num">15.12</span> Show line numbers in programming modes {#show-line-numbers-in-programming-modes}

<a id="code-snippet--linum-for-progmode"></a>
```emacs-lisp
(add-hook 'prog-mode-hook
                (if (and (fboundp 'display-line-numbers-mode) (display-graphic-p))
                    #'display-line-numbers-mode
                  #'linum-mode))
```


### <span class="section-num">15.13</span> Files from script directories default to shell-mode {#files-from-script-directories-default-to-shell-mode}

Scope for adding more such shit?

```emacs-lisp
(add-to-list 'auto-mode-alist '("/bin/" . sh-mode))
(add-to-list 'auto-mode-alist '("/srcpkgs/[[:ascii:]]+/template" . sh-mode))
```


### <span class="section-num">15.14</span> Editing root files &amp; privelege escalation for TRAMP if I ever use it {#editing-root-files-and-privelege-escalation-for-tramp-if-i-ever-use-it}

```emacs-lisp
(use-package su
  ;; :config
  ;; (su-mode +1)
  )
```


### <span class="section-num">15.15</span> Whitespace mopup {#whitespace-mopup}

<a id="code-snippet--del-whitespace"></a>
```emacs-lisp
(add-hook 'before-save-hook
          'delete-trailing-whitespace) ;; Delete trailing whitespace on save
```


### <span class="section-num">15.16</span> Multiple cursors {#multiple-cursors}

This is like `C-v`, a visual mode in vim/neovim. I stole this from
[pragmatic emacs](https://pragmaticemacs.com/emacs/multiple-cursors/).

<a id="code-snippet--multiple-cursors"></a>
```emacs-lisp
(global-set-key (kbd "C-c m c") 'peremacs/edit-lines)
```


### <span class="section-num">15.17</span> Delete blank lines and whitespace interactively {#delete-blank-lines-and-whitespace-interactively}

Plagiarised from [pragmatic emacs](https://pragmaticemacs.com/emacs/delete-blank-lines-and-shrink-whitespace/)

<a id="code-snippet--shrink-whitespace"></a>
```emacs-lisp
(global-set-key (kbd "M-SPC") 'shrink-whitespace)
```


### <span class="section-num">15.18</span> Autoupdate buffer if files has changed on disk {#autoupdate-buffer-if-files-has-changed-on-disk}

<a id="code-snippet--reload-buffer-on-modification"></a>
```emacs-lisp
(global-auto-revert-mode t)
```


## <span class="section-num">16</span> Languages {#languages}


### <span class="section-num">16.1</span> Vimscript for editing neovim init {#vimscript-for-editing-neovim-init}

...cause neovim sucks and I don't like leaving Emacs in the ideal
case. I might end up replacing this with a **lua config**

```emacs-lisp
;; vimrc syntax
(use-package vimrc-mode)
;; :ensure t
(add-to-list 'auto-mode-alist '("\\.vim\\(rc\\)?\\'" . vimrc-mode))
```


### <span class="section-num">16.2</span> Lua mode? {#lua-mode}

I intend to learn and use lua for my neovim config.

```emacs-lisp
(use-package lua-mode)
```
