content-org/emacs/literate-emacs-configuration.org
** C and C++ ???

Like really?

#+begin_src emacs-lisp
  ;; (use-package cc-mode)
#+end_src


** El Doc for help in echo area

#+begin_src emacs-lisp
  (use-package eldoc
    :straight (:type built-in)

    :hook
    ((emacs-lisp-mode-hook . eldoc-mode)
     (lisp-interaction-mode-hook . eldoc-mode)
     (ielm-mode-hook . eldoc-mode)
     (org-mode . eldoc-mode)))
#+end_src


** Zig mode

#+begin_src emacs-lisp
  (use-package zig-mode
    :config
    (add-to-list 'auto-mode-alist '("\\.zig\\'" . zig-mode)))
#+end_src


** Yaml

#+begin_src emacs-lisp

  (use-package yaml-mode
    :config
    ;;autoloads
    (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))

    ;; indent and new-line on return; the mode enforces spaces instead
    ;; of tabs
    (add-hook 'yaml-mode-hook
          (lambda ()
            (define-key yaml-mode-map "\C-m" 'newline-and-indent))))

#+end_src


* Terminal

Vterm ftw

#+begin_src emacs-lisp
  (use-package vterm
    ;; :ensure t
    :load-path "/usr/lib/libvterm.so.0.0.3"

    :init
    ;;  (setq vterm-term-environment-variable "eterm-256color")
    (setq vterm-disable-bold-font t)
    (setq vterm-kill-buffer-on-exit t)
    (setq vterm-module-cmake-args "-DUSE_SYSTEM_LIBVTERM=no")
    (setq vterm-always-compile-module t)
    (setq vterm-copy-exclude-prompt t))
#+end_src

Make vterm behave like a guake terminal and open below the main
window. This can be toggled and opens only one instance per window
(afaik). Considering using [[https://github.com/jixiuf/vterm-toggle#vterm-toggle-use-dedicated-buffer][this feature]] to not provide a dedicated
buffer to vterm so it sticks to the window it was launched with.

#+begin_src emacs-lisp
  (use-package vterm-toggle

    :bind
    (("C-M-'" . vterm-toggle-cd))

    :config

    ;; reset window layout after kill
    (setq vterm-toggle-reset-window-configration-after-exit t)

    ;; toggle behaviour - like a toggle keep it running
    (setq vterm-toggle-hide-method nil)

#+end_src


Show vterm in a window at the bottom

#+begin_src emacs-lisp
  (setq vterm-toggle-fullscreen-p nil)
  (add-to-list 'display-buffer-alist
           '((lambda(bufname _) (with-current-buffer bufname (equal major-mode 'vterm-mode)))
              (display-buffer-reuse-window display-buffer-at-bottom)
              ;;(display-buffer-reuse-window display-buffer-in-direction)
              ;;display-buffer-in-direction/direction/dedicated is added in emacs27
              ;;(direction . bottom)
              ;;(dedicated . t) ;dedicated is supported in emacs27
              (reusable-frames . visible)
              (window-height . 0.3)))
#+end_src


Make counsel use the correct function to yank in vterm buffers.

#+begin_src emacs-lisp
  (defun vterm-counsel-yank-pop-action (orig-fun &rest args)
    (if (equal major-mode 'vterm-mode)
        (let ((inhibit-read-only t)
              (yank-undo-function (lambda (_start _end) (vterm-undo))))
          (cl-letf (((symbol-function 'insert-for-yank)
                 (lambda (str) (vterm-send-string str t))))
              (apply orig-fun args)))
      (apply orig-fun args)))

  (advice-add 'counsel-yank-pop-action :around #'vterm-counsel-yank-pop-action))
#+end_src



* Multimedia


** EMMS for music

#+begin_src emacs-lisp
  (use-package emms
    :commands emms
    :config
    (require 'emms-setup)
    (emms-standard)
    (emms-default-players)
    (emms-mode-line-disable)
    (setq emms-source-file-default-directory "~/Music/")
    ;;(dw/leader-key-def
      ;;"am"  '(:ignore t :which-key "media")
      ;;"amp" '(emms-pause :which-key "play / pause")
      ;;"amf" '(emms-play-file :which-key "play file"))
    )
#+end_src



** TODO View ePubs and PDFs in Emacs

#+begin_src emacs-lisp
  (use-package nov
    :mode ("\\.epub\\'" . nov-mode)
    :config (nov-text-width 75))

  (use-package pdf-tools
    :magic ("%PDF" . pdf-view-mode)
    :mode ("\\.pdf\\'" . pdf-view-mode)
    :config (pdf-tools-install :no-query))

  ;; TODO this needs fixing idk why even
  ;; (use-package pdf-view
  ;;   :ensure nil
  ;;   :after pdf-tools
  ;;   :bind (:map pdf-view-mode-map
  ;;               ("C-s" . isearch-forward)
  ;;               ("d" . pdf-annot-delete)
  ;;               ("h" . pdf-annot-add-highlight-markup-annotation)
  ;;               ("t" . pdf-annot-add-text-annotation))
  ;;   :custom
  ;;   (pdf-view-display-size 'fit-page)
  ;;   (pdf-view-resize-factor 1.1)
  ;;   (pdf-view-use-unicode-ligther nil))
#+end_src



* Web

  Got most of these from [[https://github.com/daviwil/dotfiles/blob/9776d65c4486f2fa08ec60a06e86ecb6d2c40085/Emacs.org][daviwil]]'s literate configuration


** Gemini

#+begin_src emacs-lisp
  (use-package elpher)
#+end_src


** TODO mail with mu4e

see [[https://github.com/daviwil/dotfiles/blob/9776d65c4486f2fa08ec60a06e86ecb6d2c40085/Mail.org][daviwil's mail.org]] and the configuration in his [[https://github.com/daviwil/dotfiles/blob/9776d65c4486f2fa08ec60a06e86ecb6d2c40085/Emacs.org#mail][literate config]].


** TODO Browser


** Elfeed for RSS

#+begin_src emacs-lisp
  (use-package elfeed
    :commands elfeed
    :config
    (setq elfeed-feeds
          '("https://drewdevault.com/blog/index.xml"
            "https://sourcehut.org/blog/index.xml"
            "https://ambikamath.com/feed/")))
#+end_src



** DISABLED ERC for IRC                                             :noexport:
:PROPERTIES:
:header-args: :tangle no
:VISIBILITY: folded
:END:

SystemCrafters recommends this so here I am using it. *Long source
block split into multiple ones*.

#+begin_src emacs-lisp
  (use-package erc

      :straight (:type built-in)

      :config
      (setq erc-server "irc.libera.chat"
          erc-nick "peregrinator"    ; Change this!
          erc-user-full-name "Brihadeesh S"  ; And this!
          erc-track-shorten-start 8
          erc-autojoin-channels-alist '(("irc.libera.chat" "#voidlinux" "#xbps" "#emacs" "#bash" "#sway" "#river" "#systemcrafters"))
          erc-kill-buffer-on-part t
          erc-auto-query 'bury
          erc-server-auto-reconnect t
          erc-server-reconnect-timeout 15)
#+end_src


Configuring SASL for automatic authentication

#+begin_src emacs-lisp
  ;; continued from above
  (add-to-list 'load-path "~/.emacs.d/lisp/erc-libera-sasl")

  ;; Require ERC-SASL package
  (require 'erc-sasl)
  (add-to-list 'erc-sasl-server-regexp-list "irc\\.freenode\\.net")

  (defun erc-login ()
    "Perform user authentication at the IRC server. (PATCHED)"
    (erc-log (format "login: nick: %s, user: %s %s %s :%s"
                     (erc-current-nick)
                     (user-login-name)
                     (or erc-system-name (system-name))
                     erc-session-server
                     erc-session-user-full-name))
    (if erc-session-password
        (erc-server-send (format "PASS %s" erc-session-password))
      (message "Logging in without password"))
    (when (and (featurep 'erc-sasl) (erc-sasl-use-sasl-p))
      (erc-server-send "CAP REQ :sasl"))
    (erc-server-send (format "NICK %s" (erc-current-nick)))
    (erc-server-send
     (format "USER %s %s %s :%s"
             ;; hacked - S.B.
             (if erc-anonymous-login erc-email-userid (user-login-name))
             "0" "*"
             erc-session-user-full-name))
    (erc-update-mode-line))
#+end_src


Set prompt to channel name:

#+begin_src emacs-lisp
(setq erc-prompt  (lambda () (concat (buffer-name) " > ")))
#+end_src

Highlight nicks

#+begin_src emacs-lisp
(require 'erc-highlight-nicknames)
(add-to-list 'erc-modules 'highlight-nicknames)
#+end_src

Update ERC modules

#+begin_src emacs-lisp
(erc-update-modules))
#+end_src



* Footer

#+begin_src emacs-lisp
 ;;; configuration.el ends here
#+end_src
