content/emacs/literate-emacs-configuration.md


### <span class="section-num">16.3</span> C and C++ ??? {#c-and-c-plus-plus}

Like really?

```emacs-lisp
;; (use-package cc-mode)
```


### <span class="section-num">16.4</span> El Doc for help in echo area {#el-doc-for-help-in-echo-area}

```emacs-lisp
(use-package eldoc
  :straight (:type built-in)

  :hook
  ((emacs-lisp-mode-hook . eldoc-mode)
   (lisp-interaction-mode-hook . eldoc-mode)
   (ielm-mode-hook . eldoc-mode)
   (org-mode . eldoc-mode)))
```


### <span class="section-num">16.5</span> Zig mode {#zig-mode}

```emacs-lisp
(use-package zig-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.zig\\'" . zig-mode)))
```


### <span class="section-num">16.6</span> Yaml {#yaml}

```emacs-lisp

(use-package yaml-mode
  :config
  ;;autoloads
  (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))

  ;; indent and new-line on return; the mode enforces spaces instead
  ;; of tabs
  (add-hook 'yaml-mode-hook
        (lambda ()
          (define-key yaml-mode-map "\C-m" 'newline-and-indent))))

```


## <span class="section-num">17</span> Terminal {#terminal}

Vterm ftw

```emacs-lisp
(use-package vterm
  ;; :ensure t
  :load-path "/usr/lib/libvterm.so.0.0.3"

  :init
  ;;  (setq vterm-term-environment-variable "eterm-256color")
  (setq vterm-disable-bold-font t)
  (setq vterm-kill-buffer-on-exit t)
  (setq vterm-module-cmake-args "-DUSE_SYSTEM_LIBVTERM=no")
  (setq vterm-always-compile-module t)
  (setq vterm-copy-exclude-prompt t))
```

Make vterm behave like a guake terminal and open below the main
window. This can be toggled and opens only one instance per window
(afaik). Considering using [this feature](https://github.com/jixiuf/vterm-toggle#vterm-toggle-use-dedicated-buffer) to not provide a dedicated
buffer to vterm so it sticks to the window it was launched with.

```emacs-lisp
(use-package vterm-toggle

  :bind
  (("C-M-'" . vterm-toggle-cd))

  :config

  ;; reset window layout after kill
  (setq vterm-toggle-reset-window-configration-after-exit t)

  ;; toggle behaviour - like a toggle keep it running
  (setq vterm-toggle-hide-method nil)

```

Show vterm in a window at the bottom

```emacs-lisp
(setq vterm-toggle-fullscreen-p nil)
(add-to-list 'display-buffer-alist
         '((lambda(bufname _) (with-current-buffer bufname (equal major-mode 'vterm-mode)))
            (display-buffer-reuse-window display-buffer-at-bottom)
            ;;(display-buffer-reuse-window display-buffer-in-direction)
            ;;display-buffer-in-direction/direction/dedicated is added in emacs27
            ;;(direction . bottom)
            ;;(dedicated . t) ;dedicated is supported in emacs27
            (reusable-frames . visible)
            (window-height . 0.3)))
```

Make counsel use the correct function to yank in vterm buffers.

```emacs-lisp
(defun vterm-counsel-yank-pop-action (orig-fun &rest args)
  (if (equal major-mode 'vterm-mode)
      (let ((inhibit-read-only t)
            (yank-undo-function (lambda (_start _end) (vterm-undo))))
        (cl-letf (((symbol-function 'insert-for-yank)
               (lambda (str) (vterm-send-string str t))))
            (apply orig-fun args)))
    (apply orig-fun args)))

(advice-add 'counsel-yank-pop-action :around #'vterm-counsel-yank-pop-action))
```


## <span class="section-num">18</span> Multimedia {#multimedia}


### <span class="section-num">18.1</span> EMMS for music {#emms-for-music}

```emacs-lisp
(use-package emms
  :commands emms
  :config
  (require 'emms-setup)
  (emms-standard)
  (emms-default-players)
  (emms-mode-line-disable)
  (setq emms-source-file-default-directory "~/Music/")
  ;;(dw/leader-key-def
    ;;"am"  '(:ignore t :which-key "media")
    ;;"amp" '(emms-pause :which-key "play / pause")
    ;;"amf" '(emms-play-file :which-key "play file"))
  )
```


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">18.2</span> View ePubs and PDFs in Emacs {#view-epubs-and-pdfs-in-emacs}

```emacs-lisp
(use-package nov
  :mode ("\\.epub\\'" . nov-mode)
  :config (nov-text-width 75))

(use-package pdf-tools
  :magic ("%PDF" . pdf-view-mode)
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :config (pdf-tools-install :no-query))

;; TODO this needs fixing idk why even
;; (use-package pdf-view
;;   :ensure nil
;;   :after pdf-tools
;;   :bind (:map pdf-view-mode-map
;;               ("C-s" . isearch-forward)
;;               ("d" . pdf-annot-delete)
;;               ("h" . pdf-annot-add-highlight-markup-annotation)
;;               ("t" . pdf-annot-add-text-annotation))
;;   :custom
;;   (pdf-view-display-size 'fit-page)
;;   (pdf-view-resize-factor 1.1)
;;   (pdf-view-use-unicode-ligther nil))
```


## <span class="section-num">19</span> Web {#web}

Got most of these from [daviwil](https://github.com/daviwil/dotfiles/blob/9776d65c4486f2fa08ec60a06e86ecb6d2c40085/Emacs.org)'s literate configuration


### <span class="section-num">19.1</span> Gemini {#gemini}

```emacs-lisp
(use-package elpher)
```


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">19.2</span> mail with mu4e {#mail-with-mu4e}

see [daviwil's mail.org](https://github.com/daviwil/dotfiles/blob/9776d65c4486f2fa08ec60a06e86ecb6d2c40085/Mail.org) and the configuration in his [literate config](https://github.com/daviwil/dotfiles/blob/9776d65c4486f2fa08ec60a06e86ecb6d2c40085/Emacs.org#mail).


### <span class="org-todo todo TODO">TODO</span> <span class="section-num">19.3</span> Browser {#browser}


### <span class="section-num">19.4</span> Elfeed for RSS {#elfeed-for-rss}

```emacs-lisp
(use-package elfeed
  :commands elfeed
  :config
  (setq elfeed-feeds
        '("https://drewdevault.com/blog/index.xml"
          "https://sourcehut.org/blog/index.xml"
          "https://ambikamath.com/feed/"
          "https://emersion.fr/blog/atom.xml")))
```


## <span class="section-num">20</span> Footer {#footer}

```emacs-lisp
;;; configuration.el ends here
```
